[
    {
        "note": "external collaboration",
        "keywords": "feature model, modeling, SPL, tool, UVL, variability",
        "abstract": "The Universal Variability Language (UVL) is increasingly adopted as a standard language for feature modeling in software product lines (SPL). In this tutorial, we present advanced modeling scenarios that highlight when and how to use UVL’s language levels and extensions. We also provide a comprehensive overview of the UVL ecosystem, showcasing the tools currently available to support modeling, analysis, sharing, and visualization of feature models.",
        "doi": "10.1145/3744915.3749149",
        "url": "https://doi.org/10.1145/3744915.3749149",
        "month": "August",
        "address": "A Coruña, Spain",
        "year": "2025",
        "track": "Tutorial",
        "volume": "B",
        "publisher": "{ACM}",
        "pages": "241",
        "booktitle": "29th {ACM} International Systems and Software Product Line Conference ({SPLC})",
        "title": "Third Tutorial on the Universal Variablity Language: Practical Extensions and Tool Ecosystem",
        "author": "José Miguel Horcas and Chico Sundermann and Malte Grave and José A. Galindo and Thomas Thüm and Rick Rabiser and David Benavides",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2025_ThirdTutorialUVL"
    },
    {
        "keywords": "Configuration, feature model, SPL, tool, UVL, variability",
        "abstract": "The Universal Variability Language (UVL) is a community-driven initiative aiming to provide a standardized textual language for specifying feature models. UVL is currently supported by a growing ecosystem of tools. While these tools primarily address the problem space of Software Product Lines, its connection to the solution space to derive product variants from reusable artifacts lacks adequate tool support, particularly when handling complex variability beyond Boolean features. To address this gap, we present UVengine, a variability resolution engine that enables the generation of customized products using a template-based approach. UVengine supports all UVL language extensions and allows resolving variability over language-independent, text-based artifacts. It integrates seamlessly with the UVL ecosystem and ensures traceability from feature configurations to implementation artifacts.",
        "doi": "10.1145/3748269.3748486",
        "url": "https://doi.org/10.1145/3748269.3748486",
        "month": "August",
        "address": "A Coruña, Spain",
        "year": "2025",
        "track": "Tool",
        "volume": "B",
        "publisher": "{ACM}",
        "pages": "27--30",
        "booktitle": "29th {ACM} International Systems and Software Product Line Conference ({SPLC})",
        "title": "{UV}engine: A Universal Variability Resolution Engine for Feature Models Using Template-Based Artifacts",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2025_UVengine"
    },
    {
        "awards": "Best Research Paper Award Candidate",
        "keywords": "Dataset, feature model, product line, restaurant, UVL, variability",
        "abstract": "Product lines are implicitly practiced across various industries, yet many organizations lack formal variability management, leading to inconsistencies and potential losses. This paper introduces a comprehensive dataset of over 50 real-world feature models expressed in the Universal Variability Language (UVL), focusing on the restaurant business domain — a sector where variability is naturally present but often unmanaged. By synthesizing feature models from actual product portfolios, we demonstrate the application of advanced UVL constructs including attributes, feature cardinalities, and arithmetic expressions. Moreover, we have identified several notable gaps in UVL’s expressiveness when modeling complex real-world scenarios. The contribution is threefold: (1) providing an accessible dataset for education and industry adoption, (2) showcasing up to ten practical variability modeling strategies for common challenges, and (3) identifying limitations in UVL’s current expressiveness while proposing potential extensions. Unlike previous datasets primarily containing Boolean feature models translated from existing formats, our dataset leverages UVL’s full capabilities to represent authentic variability scenarios, making product line technology more accessible to practitioners beyond academia and highlighting opportunities for further language development.",
        "doi": "10.1145/3744915.3748468",
        "url": "https://doi.org/10.1145/3744915.3748468",
        "month": "August",
        "address": "A Coruña, Spain",
        "year": "2025",
        "volume": "A",
        "publisher": "{ACM}",
        "pages": "105--116",
        "booktitle": "29th {ACM} International Systems and Software Product Line Conference ({SPLC})",
        "title": "Exploring Variability Modeling Challenges in UVL with a Dataset from the Restaurant Industry",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2025_RestaurantsDomain"
    },
    {
        "note": "external collaboration",
        "keywords": "Effective communication, Graphs, Tables, Software product line, Variability, Visualization",
        "abstract": "Data visualization aims to convey quantitative and qualitative information effectively by determining which techniques and visualizations are most appropriate for different situations and why. Various software solutions can produce numerous visualizations of the same data set. However, data visualization encompasses a wide range of visual configurations that depend on factors such as the type of data being displayed, the different displays (e.g., scatter plots, line graphs, and pie charts), the visual components used to represent the data (e.g., lines, dots, and bars), and the specific visual attributes of those components (e.g., color, shape, size, and length). A similar problem arises when designing data tables, where the dimensionality of the data and its complexity influence the choice of the most appropriate structure (e.g., unidirectional, bidirectional). Often, this broad spectrum of configurations requires a visualization expert who knows which techniques are best for which type of data source and what is to be conveyed. Typically, researchers and developers lack knowledge of data visualization best practices and must learn the design principles that enable effective communication and the technical details of the specific software tool they use to generate visualizations. This paper proposes a software product line approach to model and realize the variability of the visualization design process, using feature models to encode knowledge about design best practices in graphs and charts. Our approach involves solving visualization design variability through a stepwise configuration process and evaluating the proposal for a specific software visualization tool. Our solution facilitates effective communication of quantitative results by helping researchers and developers select and generate the most effective visualizations for each case. This approach opens up new opportunities for research at the intersection of data visualization and variability.",
        "jcr": "Q1 (23/128) Computer Science, Software Engineering. Impact factor: 4.1",
        "month": "jul",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/journals/jss/RomeroOrganvidezHGB24.bib",
        "timestamp": "Tue, 18 Jun 2024 01:00:00 +0200",
        "doi": "10.1016/J.JSS.2024.112029",
        "url": "https://doi.org/10.1016/j.jss.2024.112029",
        "year": "2024",
        "pages": "112029",
        "specialissue": "Special Issue on Managing Variability in Complex Software-Intensive Systems",
        "volume": "213",
        "journal": "J. Syst. Softw.",
        "title": "Data visualization guidance using a software product line approach",
        "author": "David Romero-Organvidez and José Miguel Horcas and José A. Galindo and David Benavides",
        "ENTRYTYPE": "article",
        "ID": "RomeroOrganvidez2024_DataVisualizationSPL"
    },
    {
        "note": "external collaboration",
        "keywords": "random sampling, configurable systems, variability modeling, software product lines, Kconfig, SAT, randconfig",
        "abstract": "The configuration space of some systems is so large that it cannot be computed. This is the case with the Linux Kernel, which provides almost 19,000 configurable options described across more than 1,600 files in the Kconfig language. As a result, many analyses of the Kernel rely on sampling its configuration space (e.g., debugging compilation errors, predicting configuration performance, finding the configuration that optimizes specific performance metrics, etc.). The Kernel can be sampled pragmatically, with its built-in tool conf, or idealistically, translating the Kconfig files into logic formulas. The pros of the idealistic approach are that it provides statistical guarantees for the sampled configurations, but the cons are that it sets out many challenging problems that have not been solved yet, such as scalability issues. This paper introduces a new version of conf called randconfig+, which incorporates a series of improvements that increase the randomness and correctness of pragmatic sampling and also help validate the Boolean translation required for the idealistic approach. randconfig+ has been tested on 20,000 configurations generated for 10 different Kernel versions from 2003 to the present day. The experimental results show that randconfig+ is compatible with all tested Kernel versions, guarantees the correctness of the generated configurations, and increases conf’s randomness for numeric and string options.",
        "url": "https://doi.org/10.1145/3646548.3672586",
        "timestamp": "Wed, 14 Aug 2024 08:59:20 +0200",
        "doi": "10.1145/3646548.3672586",
        "biburl": "https://dblp.org/rec/conf/splc/Fernandez-Amoros24.bib",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "volume": "A",
        "publisher": "{ACM}",
        "pages": "24--35",
        "month": "September",
        "address": "Dommeldange, Luxembourg",
        "year": "2024",
        "title": "Pragmatic Random Sampling of the {Linux Kernel}: Enhancing the Randomness and Correctness of the conf Tool",
        "booktitle": "28th {ACM} International Systems and Software Product Line Conference ({SPLC})",
        "author": "David Fernández-Amorós and Ruben Heradio and José Miguel Horcas and José A. Galindo and David Benavides and Lidia Fuentes",
        "ENTRYTYPE": "inproceedings",
        "ID": "FernandezAmoros2024_PragmaticRandomSamplingLinuxKernel"
    },
    {
        "track": "Tutorial",
        "note": "external collaboration",
        "keywords": "Open science, configurable systems, variability modeling",
        "abstract": "Open science is a movement aimed at making scientific research, data, and dissemination accessible. In this tutorial, we will explore how to adapt this research philosophy to the context of the software product line community. To achieve this, we present a tooling ecosystem created with open science in mind. Concretely, we will rely on uvlhub for dataset sharing, flamapy to enrich and extract the metrics, and the Fact-Label tool to visualize the data at a glance. Participants will gain hands-on experience with each tool and learn how these tools can be integrated into their research workflows.",
        "url": "https://doi.org/10.1145/3646548.3674550",
        "timestamp": "Tue, 13 Aug 2024 01:00:00 +0200",
        "doi": "10.1145/3646548.3674550",
        "biburl": "https://dblp.org/rec/conf/splc/GalindoRBA024.bib",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "volume": "A",
        "publisher": "{ACM}",
        "pages": "223",
        "month": "September",
        "address": "Dommeldange, Luxembourg",
        "year": "2024",
        "title": "{Open Science} principles in software product lines: The case of the {UVL} ecosystem",
        "booktitle": "28th {ACM} International Systems and Software Product Line Conference ({SPLC})",
        "author": "José A. Galindo and David Romero-Organvidez and Megha Bhushan and José Miguel Horcas Aguilera and David Benavides",
        "ENTRYTYPE": "inproceedings",
        "ID": "Galindo2024_OpenScienceTutorial"
    },
    {
        "note": "external collaboration",
        "keywords": "data migration, data transformation, SPL, feature model",
        "abstract": "Software evolution often requires data management and more concretely data migration. Data migration follows an ETL process: extracting (E) data from a source, transforming (T) the data depending on migration needs, and loading (L) the data in a target data storage. Data migration projects are recognised to be complex and challenging to manage, which can lead to resource loss and planning delays. Among the reasons for data migration project failure is the lack of systematic artifact reuse (e.g., transformation script) in the data migration process. Every new data migration project is often developed from scratch. Software product line (SPL) engineering has been applied in many different domains to systematically reuse artifacts (e.g., code platforms, test cases) in software development processes and there are many positive experiences when applying SPL to reduce cost and time. In this paper, we present an approach using SPL techniques for data migration projects, concretely, in the data transformation stage. Our solution facilitates the automated creation of scripts that can be reused in different data migration projects. The feasibility of the proposal is validated in the domain of web information systems modernization. The validation shows how various migration scripts can be created to transform data between different content management systems. With this work, new opportunities are opened for studying the synergies of SPL and data migration. To the best of our knowledge, this is the first proposal that uses a complete stack of SPL that materializes the reuse of artifacts for data migration.",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/vamos/Romero-Organvidez24.bib",
        "timestamp": "Fri, 26 Jan 2024 00:00:00 +0100",
        "doi": "10.1145/3634713.3634724",
        "url": "https://doi.org/10.1145/3634713.3634724",
        "month": "Feb",
        "address": "Bern, Switzerland",
        "year": "2024",
        "publisher": "{ACM}",
        "pages": "83--92",
        "booktitle": "18th International Working Conference on Variability Modelling of Software-Intensive Systems ({VaMoS})",
        "title": "Variability in data transformation: towards data migration product lines",
        "author": "David Romero-Organvidez and David Benavides and José Miguel Horcas and María Teresa Gómez-López",
        "ENTRYTYPE": "inproceedings",
        "ID": "RomeroOrganvidez2024_DataTransformationVariability"
    },
    {
        "note": "external collaboration",
        "keywords": "Automated analysis, Configurable systems, Feature models, Monte Carlo tree search, Software product lines, Variability",
        "abstract": "Challenging domains of the future such as Smart Cities, Cloud Computing, or Industry 4.0 expose highly variable systems with colossal configuration spaces. The automated analysis of those systems’ variability has often relied on SAT solving and constraint programming. However, many of the analyses have to deal with the uncertainty introduced by the fact that undertaking an exhaustive exploration of the whole configuration space is usually intractable. In addition, not all analyses need to deal with the configuration space of the feature models, but with different search spaces where analyses are performed over the structure of the feature models, the constraints, or the implementation artifacts, instead of configurations. This paper proposes a conceptual framework that tackles various of those analyses using Monte Carlo tree search methods, which have proven to succeed in vast search spaces (e.g., game theory, scheduling tasks, security, program synthesis, etc.). Our general framework is formally described, and its flexibility to cope with a diversity of analysis problems is discussed. We provide a Python implementation of the framework that shows the feasibility of our proposal, identifying up to 11 lessons learned, and open challenges about the usage of the Monte Carlo methods in the software product line context. With this contribution, we envision that different problems can be addressed using Monte Carlo simulations and that our framework can be used to advance the state-of-the-art one step forward.",
        "jcr": "Q1 (29/132) Computer Science, Software Engineering. Impact factor: 3.7",
        "month": "jan",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/journals/jss/HorcasGHFB23.bib",
        "timestamp": "Tue, 21 Mar 2023 00:00:00 +0100",
        "doi": "10.1016/J.JSS.2022.111551",
        "url": "https://doi.org/10.1016/j.jss.2022.111551",
        "year": "2023",
        "pages": "111551",
        "specialissue": "Special Issue on Systems and Software Product Lines of the Future",
        "volume": "195",
        "journal": "J. Syst. Softw.",
        "title": "A Monte Carlo tree search conceptual framework for feature model analyses",
        "author": "José Miguel Horcas and José A. Galindo and Ruben Heradio and David Fernández-Amorós and David Benavides",
        "ENTRYTYPE": "article",
        "ID": "Horcas2023_MCTS"
    },
    {
        "keywords": "Variability modeling language, Modular metamodel, Model refactoring, Model specialization, Interoperability, Edge computing",
        "abstract": "Emergent application domains, such as cyber–physical systems, edge computing or industry 4.0. present a high variability in software and hardware infrastructures. However, no single variability modeling language supports all language extensions required by these application domains (i.e., attributes, group cardinalities, clonables, complex constraints). This limitation is an open challenge that should be tackled by the software engineering field, and specifically by the software product line (SPL) community. A possible solution could be to define a completely new language, but this has a high cost in terms of adoption time and development of new tools. A more viable alternative is the definition of refactoring and specialization rules that allow interoperability between existing variability languages. However, with this approach, these rules cannot be reused across languages because each language uses a different set of modeling concepts and a different concrete syntax. Our approach relies on a modular and extensible metamodel that defines a common abstract syntax for existing variability modeling extensions. We map existing feature modeling languages in the SPL community to our common abstract syntax. Using our abstract syntax, we define refactoring rules at the language construct level that help to achieve interoperability between variability modeling languages.",
        "jcr": "Q1 (29/132) Computer Science, Software Engineering. Impact factor: 3.7",
        "month": "mar",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/journals/jss/HorcasPF23.bib",
        "timestamp": "Mon, 05 Feb 2024 00:00:00 +0100",
        "doi": "10.1016/J.JSS.2022.111579",
        "url": "https://doi.org/10.1016/j.jss.2022.111579",
        "year": "2023",
        "pages": "111579",
        "volume": "197",
        "journal": "J. Syst. Softw.",
        "title": "A modular metamodel and refactoring rules to achieve software product line interoperability",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "ENTRYTYPE": "article",
        "ID": "Horcas2023_ModularMetamodelRefactoringsSPLInteroperability"
    },
    {
        "keywords": "Empirical analysis, Case studies analysis, Software product lines, State of the art, Tool support, Tooling roadmap, Variability modeling",
        "abstract": "For the last ten years, software product line (SPL) tool developers have been facing the implementation of different variability requirements and the support of SPL engineering activities demanded by emergent domains. Despite systematic literature reviews identifying the main characteristics of existing tools and the SPL activities they support, these reviews do not always help to understand if such tools provide what complex variability projects demand. This paper presents an empirical research in which we evaluate the degree of maturity of existing SPL tools focusing on their support of variability modeling characteristics and SPL engineering activities required by current application domains. We first identify the characteristics and activities that are essential for the development of SPLs by analyzing a selected sample of case studies chosen from application domains with high variability. Second, we conduct an exploratory study to analyze whether the existing tools support those characteristics and activities. We conclude that, with the current tool support, it is possible to develop a basic SPL approach. But we have also found out that these tools present several limitations when dealing with complex variability requirements demanded by emergent application domains, such as non-Boolean features or large configuration spaces. Additionally, we identify the necessity for an integrated approach with appropriate tool support to completely cover all the activities and phases of SPL engineering. To mitigate this problem, we propose different road map using the existing tools to partially or entirely support SPL engineering activities, from variability modeling to product derivation.",
        "jcr": "Q3 (68/131) Computer Science, Software Engineering. Impact factor: 2.0",
        "month": "feb",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/journals/sosym/HorcasPF23.bib",
        "timestamp": "Mon, 05 Feb 2024 00:00:00 +0100",
        "doi": "10.1007/S10270-022-01011-2",
        "url": "https://doi.org/10.1007/s10270-022-01011-2",
        "year": "2023",
        "pages": "377--414",
        "number": "1",
        "volume": "22",
        "journal": "Softw. Syst. Model.",
        "title": "Empirical analysis of the tool support for software product lines",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "ENTRYTYPE": "article",
        "ID": "Horcas2023_EmpiricalAnalysisSPLTools"
    },
    {
        "note": "external collaboration, international stay result",
        "keywords": "Software product lines, feature model configuration, search-based software engineering",
        "abstract": "When configuring a software product line, finding a good trade-off between multiple orthogonal quality concerns is a challenging multi-objective optimisation problem. State-of-the-art solutions based on search-based techniques create invalid configurations in intermediate steps, requiring additional repair actions that reduce the efficiency of the search. In this work, we introduce consistency-preserving configuration operators (CPCOs)—genetic operators that maintain valid configurations throughout the entire search. CPCOs bundle coherent sets of changes: the activation or deactivation of a particular feature together with other (de)activations that are needed to preserve validity. In our evaluation, our instantiation of the IBEA algorithm with CPCOs outperforms two state-of-the-art tools for optimal product line configuration in terms of both speed and solution quality. The improvements are especially pronounced in large product lines with thousands of features.",
        "jcr": "Q1 (9/131) Computer Science, Software Engineering. Impact factor: 6.5",
        "month": "mar",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/journals/tse/HorcasSBMZ23.bib",
        "timestamp": "Sun, 16 Apr 2023 01:00:00 +0200",
        "doi": "10.1109/TSE.2022.3171404",
        "url": "https://doi.org/10.1109/TSE.2022.3171404",
        "year": "2023",
        "pages": "1102--1117",
        "number": "3",
        "volume": "49",
        "journal": "{IEEE} Trans. Software Eng.",
        "title": "We're Not Gonna Break It! Consistency-Preserving Operators for Efficient Product Line Configuration",
        "author": "José Miguel Horcas and Daniel Strüber and Alexandru Burdusel and Jabier Martinez and Steffen Zschaler",
        "ENTRYTYPE": "article",
        "ID": "Horcas2023_CPCOs"
    },
    {
        "note": "external collaboration",
        "abstract": "Nowadays, feature models are the de facto standard when representing commonalities and variability, with modern examples spanning up to 7000 features. Manual analysis of such models is challenging and error-prone due to sheer size. To help in this task, automated analysis of feature models (AAFM) has emerged over the past three decades. However, the diversity of these tools and their supported languages presents a significant challenge that motivated the MOD-EVAR community to initiate a project for a new tool that supports the UVL language. Despite the rise of machine learning and data science, along with robust Python-based libraries, most AAFM tools have been implemented in Java, creating a collaboration gap. This paper introduces Flama, an innovative framework that automates the analysis of variability models. It focuses on UVL model analysis and aims for easy integration and extensibility to bridge this gap and foster better community and cross-community collaboration.",
        "track": "Tool",
        "url": "https://doi.org/10.1145/3579028.3609008",
        "timestamp": "Sat, 09 Sep 2023 00:04:38 +0200",
        "doi": "10.1145/3579028.3609008",
        "biburl": "https://dblp.org/rec/conf/splc/GalindoHFF023.bib",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "volume": "B",
        "publisher": "{ACM}",
        "pages": "16--19",
        "month": "aug",
        "address": "Tokyo, Japan",
        "year": "2023",
        "title": "{FLAMA:} {A} collaborative effort to build a new framework for the automated analysis of feature models",
        "booktitle": "27th {ACM} International Systems and Software Product Line Conference ({SPLC})",
        "author": "José A. Galindo and José Miguel Horcas and Alexander Felfernig and David Fernández-Amorós and David Benavides",
        "ENTRYTYPE": "inproceedings",
        "ID": "Galindo2023_Flama"
    },
    {
        "note": "external collaboration",
        "keywords": "Decision making support, feature model, software product line, subjective logic, uncertainty",
        "abstract": "The planning, realization, and release of a Software Product Line (SPL) are driven by features. Therefore, many high-level decisions about the evolution of an SPL are made at the feature level. However, a feature can involve many stakeholders with different expertise, and taking their opinions into account to make the right decisions is not trivial. In this paper, we propose using belief uncertainty in conjunction with feature models to assist in the evolution of SPLs by explicitly quantifying opinions. We outline three evolution scenarios in which subjective logic can be used to represent the opinions of stakeholders and explain in detail how to use subjective logic to make decisions in the context of the next release problem. We illustrate our ideas with a Smartwatch SPL. Finally, we discuss different ways of combining the opinions of stakeholders depending on the situation, the goals and the risks that can be assumed.",
        "track": "short",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/splc/BurguenoHK23.bib",
        "timestamp": "Thu, 31 Aug 2023 01:00:00 +0200",
        "doi": "10.1145/3579027.3608975",
        "url": "https://doi.org/10.1145/3579027.3608975",
        "month": "August",
        "address": "Tokyo, Japan",
        "year": "2023",
        "volume": "A",
        "publisher": "{ACM}",
        "pages": "34--40",
        "booktitle": "27th {ACM} International Systems and Software Product Line Conference ({SPLC})",
        "title": "Development and Evolution of Software Product Lines Driven by Stakeholder Beliefs",
        "author": "Lola Burgueño and José Miguel Horcas and Jörg Kienzle",
        "ENTRYTYPE": "inproceedings",
        "ID": "Burgueno2023_UncertaintySubjectiveLogic"
    },
    {
        "keywords": "Automated analysis, constraint, feature model, feature tree, parallelization, software product line",
        "abstract": "Cross-tree constraints give feature models maximal expressive power since any interdependency between features can be captured through arbitrary propositional logic formulas. However, the existence of these constraints increases the complexity of reasoning about feature models, both for using SAT solvers or compiling the model to a binary decision diagram for efficient analyses. Although some works have tried to refactor constraints to eliminate them, they deal only with simple constraints (i.e., requires and excludes) or require the introduction of an additional set of features, increasing the complexity of the resulting feature model. This paper presents an approach that eliminates all the cross-tree constraints present in regular boolean feature models, including arbitrary constraints, in propositional logic formulas. Our approach for removing constraints consists of splitting the semantics of feature models into orthogonal disjoint feature subtrees, which are then analyzed in parallel to alleviate the exponential blow-up in memory of the resulting feature tree.",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/splc/HorcasBPF23.bib",
        "timestamp": "Thu, 31 Aug 2023 01:00:00 +0200",
        "doi": "10.1145/3579027.3608981",
        "url": "https://doi.org/10.1145/3579027.3608981",
        "month": "August",
        "address": "Tokyo, Japan",
        "year": "2023",
        "volume": "A",
        "publisher": "{ACM}",
        "pages": "99--110",
        "booktitle": "27th {ACM} International Systems and Software Product Line Conference ({SPLC})",
        "title": "Elimination of constraints for parallel analysis of feature models",
        "author": "José Miguel Horcas and Joaquín Ballesteros and Mónica Pinto and Lidia Fuentes",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2023_ConstraintsElimination"
    },
    {
        "note": "external collaboration",
        "keywords": "Annotations, Composition, Feature models, SPL, Variability, Web engineering",
        "abstract": "Context: Web engineering involves managing a high diversity of artifacts implemented in different languages and with different levels of granularity. Technological companies usually implement variable artifacts of Software Product Lines (SPLs) using annotations, being reluctant to adopt hybrid, often complex, approaches combining composition and annotations despite their benefits. Objective: This paper proposes a combined approach to support fine and coarse-grained variability for web artifacts. The proposal allows web developers to continue using annotations to handle fine-grained variability for those artifacts whose variability is very difficult to implement with a composition-based approach, but obtaining the advantages of the composition-based approach for the coarse-grained variable artifacts. Methods: A combined approach based on feature modeling that integrates annotations into a generic composition-based approach. We propose the definition of compositional and annotative variation points with custom-defined semantics, which is resolved by a scaffolding-based derivation engine. The approach is evaluated on a real-world web-based SPL by applying a set of variability metrics, as well as discussing its quality criteria in comparison with annotations, compositional, and combined existing approaches. Results: Our approach effectively handles both fine and coarse-grained variability. The mapping between the feature model and the web artifacts promotes the traceability of the features and the uniformity of the variation points regardless of the granularity of the web artifacts. Conclusions: Using well-known techniques of SPLs from an architectural point of view, such as feature modeling, can improve the design and maintenance of variable web artifacts without the need of introducing complex approaches for implementing the underlying variability.",
        "jcr": "Q2 (30/108) Computer Science, Software Engineering. Impact factor: 3.9",
        "month": "aug",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/journals/infsof/HorcasCFL22.bib",
        "timestamp": "Tue, 16 Aug 2022 01:00:00 +0200",
        "doi": "10.1016/j.infsof.2022.106910",
        "url": "https://doi.org/10.1016/j.infsof.2022.106910",
        "year": "2022",
        "pages": "106910",
        "volume": "148",
        "journal": "Inf. Softw. Technol.",
        "title": "Combining multiple granularity variability in a software product line approach for web engineering",
        "author": "José Miguel Horcas and Alejandro Corti{\\~{n}}as and Lidia Fuentes and Miguel R. Luaces",
        "ENTRYTYPE": "article",
        "ID": "Horcas2022_CombiningMultipleGranularity"
    },
    {
        "note": "external collaboration",
        "keywords": "characterization, feature model, metrics, variability, visualization",
        "abstract": "Recognizing specific characteristics of feature models (FM) can be challenging due to the different nature and domains of the models. There are several metrics to characterize FMs. However, there is no standard way to visualize and identify the properties that make an FM unique and distinguishable. We propose FM Fact Label as a tool to visualize an FM characterization based on its metadata, structural measures, and analytical metrics. Although existing tools can provide a visualization of the FM and report some metrics, the feature diagram of large-scale FMs becomes ineffective to take an overall shape of the FM properties. Moreover, the reported metrics are often embedded in the tool user interface, preventing further analysis. FM Fact Label is a standalone web-based tool that provides a configurable and interactive visualization of FM characterizations that can be exported to several formats. Our contribution becomes important because the Universal Variability Language (UVL) is starting to gain attraction in the software product line community as a unified textual language to specify FMs and share knowledge. With this contribution, we help to advance the UVL ecosystem one step forward while providing a common representation for the results of existing analysis tools.",
        "track": "Tool",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/splc/HorcasGPF022.bib",
        "timestamp": "Tue, 21 Mar 2023 00:00:00 +0100",
        "doi": "10.1145/3503229.3547025",
        "url": "https://doi.org/10.1145/3503229.3547025",
        "month": "September",
        "address": "Graz, Austria",
        "year": "2022",
        "volume": "B",
        "publisher": "{ACM}",
        "pages": "42--45",
        "booktitle": "26th {ACM} International Systems and Software Product Line Conference ({SPLC})",
        "title": "\\emph{FM fact label}: a configurable and interactive visualization of feature model characterizations",
        "author": "José Miguel Horcas and José Angel Galindo and Mónica Pinto and Lidia Fuentes and David Benavides",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2022_FMFactLabel"
    },
    {
        "note": "external collaboration",
        "keywords": "Characterization, Feature model, Metrics, Software product line, Variability, Visualization",
        "abstract": "FM Fact Label is a tool for visualizing the characterizations of feature models based on their metadata, structural measures, and analytical metrics. Although there are various metrics available to characterize feature models, there is no standard method to visualize and identify unique properties of feature models. Unlike existing tools, FM Fact Label provides a standalone web-based platform for configurable and interactive visualization, enabling export to various formats. This contribution is significant because it supports the Universal Variability Language (UVL) and enhances the UVL ecosystem by offering a common representation of the results of existing analysis tools.",
        "jcr": "Q3 (87/128) Computer Science, Software Engineering. Impact factor: 1.4",
        "month": "feb",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/journals/scp/HorcasGFB25.bib",
        "timestamp": "Mon, 21 Oct 2024 11:11:55 +0200",
        "doi": "10.1016/J.SCICO.2024.103214",
        "url": "https://doi.org/10.1016/j.scico.2024.103214",
        "year": "2025",
        "pages": "103214",
        "specialissue": "Tools and Software at the Systems and Software Product Line Conference (SPLC 2022 and 2023)",
        "volume": "240",
        "journal": "Sci. Comput. Program.",
        "title": "{FM} fact label",
        "author": "José Miguel Horcas and José A. Galindo and Lidia Fuentes and David Benavides",
        "ENTRYTYPE": "article",
        "ID": "Horcas2025_FMFactLabel"
    },
    {
        "note": "external collaboration, international stay result",
        "keywords": "Variability management, software product lines, genetic algorithms",
        "abstract": "Configuring feature-oriented variability-rich systems is complex because of the large number of features and, potentially, the lack of visibility of the implications on quality attributes when selecting certain features. We present Acapulco as an alternative to the existing tools for automating the configuration process with a focus on mono- and multi-criteria optimization. The soundness of the tool has been proven in a previous publication comparing it to SATIBEA and MODAGAME. The main advantage was obtained through consistency-preserving configuration operators (CPCOs) that guarantee the validity of the configurations during the IBEA genetic algorithm evolution process. We present a new version of Acapulco built on top of FeatureIDE, extensible through the easy integration of objective functions, providing pre-defined reusable objectives, and being able to handle complex feature model constraints.",
        "track": "Tool",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/splc/Martinez0HBZ22.bib",
        "timestamp": "Sun, 12 Nov 2023 00:00:00 +0100",
        "doi": "10.1145/3503229.3547067",
        "url": "https://doi.org/10.1145/3503229.3547067",
        "month": "September",
        "address": "Graz, Austria",
        "year": "2022",
        "volume": "B",
        "publisher": "{ACM}",
        "pages": "50--53",
        "booktitle": "26th {ACM} International Systems and Software Product Line Conference ({SPLC})",
        "title": "Acapulco: an extensible tool for identifying optimal and consistent feature model configurations",
        "author": "Jabier Martinez and Daniel Str{\\\"{u}}ber and José Miguel Horcas and Alexandru Burdusel and Steffen Zschaler",
        "ENTRYTYPE": "inproceedings",
        "ID": "Martinez2022_Acapulco"
    },
    {
        "keywords": "effective communication, feature model, graph, quantitative data, software product line, variability, visualization",
        "abstract": "Data visualization aims to effectively communicate quantitative information by understanding which techniques and displays work better for different circumstances and why. There are a variety of software solutions capable of generating a multitude of different visualizations of the same dataset. However, data visualization exposes a large space of visual configurations depending on the type of data to be visualized, the different displays (e.g., scatter plots, line graphs, pie charts), the visual components to encode the data (e.g., lines, dots, bars), or the specific visual attributes of those components (e.g., color, shape, size, length). Researchers and developers are not usually aware about best practices in data visualization, and they are required to learn about both the design practices that make communication effective and the low level details of the specific software tool used to generate the visualization. This paper proposes a software product line approach to model and materialize the variability of the visualization design process, guided by feature models. We encode the visualization knowledge regarding the best design practices, resolve the variability following a step-wise configuration approach, and then evaluate our proposal for a specific software visualization tool. Our solution helps researchers and developers communicate their quantitative results effectively by assisting them in the selection and generation of the visualizations that work best for each case. We open a new window of research where data visualization and variability meet each other.",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/splc/HorcasG022.bib",
        "timestamp": "Mon, 26 Jun 2023 20:46:40 +0200",
        "doi": "10.1145/3546932.3546993",
        "url": "https://doi.org/10.1145/3546932.3546993",
        "month": "September",
        "address": "Graz, Austria",
        "year": "2022",
        "volume": "A",
        "publisher": "{ACM}",
        "pages": "55--66",
        "booktitle": "26th {ACM} International Systems and Software Product Line Conference ({SPLC})",
        "title": "Variability in data visualization: a software product line approach",
        "author": "José Miguel Horcas and José A. Galindo and David Benavides",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2022_DataVisualizationVariability"
    },
    {
        "keywords": "databases, migrations, model transformations, product lines, variability",
        "abstract": "Relational databases are widely present in the development of software applications. A typical implementation can be seen in content management systems found on most websites. However, the migration of database structure and content between different management systems is not trivial, and the manual creation of scripts makes it difficult to reuse them in other scenarios. This paper presents a tool for database migration by modeling what we call a migration product line. This tool allows to obtain different configurations resulting in final products in a semi-automatic way, i.e., products according to software requirements, considering the variability between any two relational databases. To study the feasibility of our proposal, we have implemented a proof of concept that performs the migration between two databases.",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/splc/RomeroGH022.bib",
        "timestamp": "Fri, 12 Apr 2024 01:00:00 +0200",
        "doi": "10.1145/3503229.3547062",
        "url": "https://doi.org/10.1145/3503229.3547062",
        "month": "September",
        "address": "Graz, Austria",
        "year": "2022",
        "volume": "B",
        "publisher": "{ACM}",
        "pages": "78--81",
        "booktitle": "1st International Workshop on Technical Debt for Variability-intensive Systems ({TD4ViS} @ {SPLC})",
        "title": "Variability-aware data migration tool",
        "author": "David Romero and José A. Galindo and José Miguel Horcas and David Benavides",
        "ENTRYTYPE": "inproceedings",
        "ID": "RomeroOrganvidez2022_VariabilityDataMigrationTool"
    },
    {
        "abstract": "Highly configurable systems expose numerous variation points to be configured by the stakeholders. Deciding which variant to select for a given variation point is hard to know a priori because each variant affects the configuration properties (e.g., performance, efficiency, fault tolerance) differently, and evaluating all configurations is practically infeasible. This paper introduces an approach based on Monte Carlo simulations to analyze the influence ofeach feature selection when configuring a variability model. We split the whole configuration space into step-wise decisions driven by the variation points that a user normally needs to face/decide during the configuration process. Monte Carlo simulations approximate the influence of each feature variant evaluating as few configurations aspossible. Our solution complements existing sampling techniques to analyze colossal configuration spaces improving the understanding of the influence of each feature selection. It can be part of a decision-making tool to assist the user by means of recommendation systems and interactive configuration processes.",
        "url": "https://ceur-ws.org/Vol-2945/32-JMHA-ConfWS21_paper_19.pdf",
        "timestamp": "Fri, 10 Mar 2023 16:22:15 +0100",
        "awards": "Best Paper Award",
        "biburl": "https://dblp.org/rec/conf/confws/AguileraMG021.bib",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "volume": "2945",
        "series": "{CEUR} Workshop Proceedings",
        "publisher": "CEUR-WS.org",
        "pages": "37--44",
        "month": "September",
        "address": "Vienna, Austria",
        "year": "2021",
        "title": "Monte Carlo Simulations for Variability Analyses in Highly Configurable Systems",
        "booktitle": "23rd International Configuration Workshop ({ConfWS})",
        "author": "José Miguel Horcas and A. Germán Márquez and José A. Galindo and David Benavides",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2021_MontecarloSimulations"
    },
    {
        "keywords": "feature model repository, characteristics, variability, requirements",
        "abstract": "Feature models are the \"de facto\" standard for variability modelling and are used in both academia and industry. The MODEVAR initiative tries to establish a common textual feature modelling language that can be used by different communities and can allow information sharing. Feature model related researches use different models for different purposes such as analysis, sampling, testing, debugging, teaching, etc. Those models are shared in private repositories and there is a risk that all that knowledge is spread across different platforms which hinder collaboration and knowledge reuse. In this paper, we propose a first working version of a new feature model repository that allows to centralise the knowledge generated in the community together with advanced capabilities such as DOI generation, an API, analysis reports, among others. Our solution is a front end interface that uses the popular open science repository Zenodo as an end point to materialise the storage of all the information. Zenodo is enhanced with characteristics that facilitate the management of the models. The idea of our repository is to provide existing but also new features that are not present in other repositories (e.g., SPLOT). We propose to populate our repository with all the existing models of many sources including SPLOT.",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/splc/RomeroGHB21.bib",
        "timestamp": "Fri, 12 Apr 2024 01:00:00 +0200",
        "doi": "10.1145/3461002.3473949",
        "url": "https://doi.org/10.1145/3461002.3473949",
        "month": "September",
        "address": "Leicester, United Kindom",
        "year": "2021",
        "volume": "B",
        "publisher": "{ACM}",
        "pages": "80--85",
        "booktitle": "4th International Workshop on Languages for Modelling Variability ({MODEVAR} @ {SPLC})",
        "title": "A first prototype of a new repository for feature model exchange and knowledge sharing",
        "author": "David Romero and José A. Galindo and José Miguel Horcas and David Benavides",
        "ENTRYTYPE": "inproceedings",
        "ID": "RomeroOrganvidez2021_FMRepo"
    },
    {
        "note": "external collaboration",
        "keywords": "configurable systems, variability modeling, feature models, Monte Carlo tree search, software product lines",
        "abstract": "The colossal solution spaces of most configurable systems make intractable their exhaustive exploration. Accordingly, relevant analyses remain open research problems. There exist analyses alternatives such as SAT solving or constraint programming. However, none of them have explored simulation-based methods. Monte Carlo-based decision making is a simulation-based method for dealing with colossal solution spaces using randomness. This paper proposes a conceptual framework that tackles various of those analyses using Monte Carlo methods, which have proven to succeed in vast search spaces (e.g., game theory). Our general framework is described formally, and its flexibility to cope with a diversity of analysis problems is discussed (e.g., finding defective configurations, feature model reverse engineering or getting optimal performance configurations). Additionally, we present a Python implementation of the framework that shows the feasibility of our proposal. With this contribution, we envision that different problems can be addressed using Monte Carlo simulations and that our framework can be used to advance the state of the art a step forward.",
        "url": "https://doi.org/10.1145/3461001.3471146",
        "timestamp": "Tue, 21 Mar 2023 00:00:00 +0100",
        "doi": "10.1145/3461001.3471146",
        "awards": "Best Paper Award",
        "biburl": "https://dblp.org/rec/conf/splc/HorcasGHF021.bib",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "volume": "A",
        "publisher": "{ACM}",
        "pages": "190--201",
        "month": "September",
        "address": "Leicester, United Kindom (virtual)",
        "year": "2021",
        "title": "Monte Carlo tree search for feature model analyses: a general framework for decision-making",
        "booktitle": "25th {ACM} International Systems and Software Product Line Conference ({SPLC})",
        "author": "José Miguel Horcas and José A. Galindo and Ruben Heradio and David Fernández-Amorós and David Benavides",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2021_MCTS"
    },
    {
        "keywords": "Android, Dynamic adaptation, Energy efficiency, Mobile application, User behavior",
        "abstract": "Context The energy consumption of mobile devices is increasing due to the improvement in their components (e.g., better processors, larger screens). Although the hardware consumes the energy, the software is responsible for managing hardware resources such as the camera software and its functionality, and therefore, affects the energy consumption. Energy consumption not only depends on the installed code, but also on the execution context (environment, devices status) and how the user interacts with the application. Objective In order to reduce the energy consumption based on user behavior, it is necessary to dynamically adapt the application. However, the adaptation mechanism also consumes a certain amount of energy in itself, which may lead to an important increase in the energy expenditure of the application in comparison with the benefits of the adaptation. Therefore, this footprint must be measured and compared with the benefit obtained. Method In this paper, we (1) determine the benefits, in terms of energy consumption, of dynamically adapting mobile applications, based on user behavior; and (2) advocate the most energy-efficient adaptation mechanism. We provide four different implementations of a proposed adaptation model and measure their energy consumption. Results The proposed adaptation engines do not increase the energy consumption when compared to the benefits of the adaptation, which can reduce the energy consumption by up to 20%. Conclusion The adaptation engines proposed in this paper can decrease the energy consumption of the mobile devices based on user behavior. The overhead introduced by the adaptation engines is negligible in comparison with the benefits obtained by the adaptation.",
        "jcr": "Q2 (31/108) Computer Science, Software Engineering. Impact factor: 2.730",
        "month": "feb",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/journals/infsof/CaneteHAF20.bib",
        "timestamp": "Tue, 16 Aug 2022 01:00:00 +0200",
        "doi": "10.1016/J.INFSOF.2019.106220",
        "url": "https://doi.org/10.1016/j.infsof.2019.106220",
        "year": "2020",
        "volume": "118",
        "journal": "Inf. Softw. Technol.",
        "title": "Energy efficient adaptation engines for android applications",
        "author": "Angel Cañete and José Miguel Horcas and Inmaculada Ayala and Lidia Fuentes",
        "ENTRYTYPE": "article",
        "ID": "Canete2020_AndroidAdaptationEngines"
    },
    {
        "track": "short",
        "keywords": "Abstract syntax, feature modeling, language construct, language level, metamodeling, model-driven engineering, SPL",
        "abstract": "Since the definition of feature models in 1990, a large number of language constructs have emerged. Each language construct usually comes with its own abstract and concrete syntax, its semantics, and even its complete language dialect and tool support. Nowadays, there is a consensus in the Software Product Line community about a need for defining a common variability modeling language. But the fact of the matter is that it is very complex to achieve a good compromise between how expressive the language should be and the effort of developing practical tools for a language with all possible language constructs. In this paper, we propose an extensible model-driven engineering approach for defining the abstract syntax of feature modeling language constructs that could be tailored to different needs and domains. We formalize our approach as a set of modular and reusable metamodels that allows practitioners to decide which subset of language constructs to use through: (1) generating a new variability language; and (2) managing feature models with different level of expressiveness. We provide an instantiation and implementation of our approach.",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/splc/HorcasPF20.bib",
        "timestamp": "Tue, 21 Mar 2023 00:00:00 +0100",
        "doi": "10.1145/3382025.3414959",
        "url": "https://doi.org/10.1145/3382025.3414959",
        "month": "October",
        "address": "Montreal, Quebec, Canada",
        "year": "2020",
        "volume": "A",
        "publisher": "{ACM}",
        "pages": "10:1--10:7",
        "booktitle": "24th {ACM} International Systems and Software Product Line Conference ({SPLC})",
        "title": "Extensible and modular abstract syntax for feature modeling based on language constructs",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2020_AbstractSyntaxFMConstructs"
    },
    {
        "keywords": "Energy efficient cyber-physical systems, software sustainability, self-adaptive greenability, Dynamic Software Product Lines",
        "abstract": "Software systems have a strong impact on the energy consumption of the hardware they use. This is especially important for cyber-physical systems where power consumption strongly influences the battery life. For this reason, software developers should be more aware of the energy consumed by their systems. Moreover, software systems should be developed to adapt their behavior to minimize the energy consumed during their execution. This can be done by monitoring the usage context of the system and having runtime support to react to those changes that impact the energy footprint negatively. Although both the hardware and the software parts of cyber-physical systems can be adapted to reduce its energy consumption, this paper focuses on software adaptation. Concretely, the paper illustrates how to address the problem of developing context-aware energy-efficient applications using a Green Eco-Assistant that makes use of advanced software engineering methods, such as Dynamic Software Product Lines and Separation of Concerns. The main steps of our approach are illustrated by applying them to a cyber-physical system case study.",
        "jcr": "Q1 (39/156) Computer Science, Information Systems. Impact factor: 3.643",
        "month": "jan",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/journals/adhoc/HorcasPF19.bib",
        "timestamp": "Mon, 05 Feb 2024 00:00:00 +0100",
        "doi": "10.1016/J.ADHOC.2018.08.004",
        "url": "https://doi.org/10.1016/j.adhoc.2018.08.004",
        "year": "2019",
        "pages": "15--30",
        "specialissue": "Advances and Trends on Cognitive Cyber-Physical Systems from 15th IEEE International Conference on Pervasive Intelligence and Computing (PICom 2017)",
        "volume": "82",
        "journal": "Ad Hoc Networks",
        "title": "Context-aware energy-efficient applications for cyber-physical systems",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "ENTRYTYPE": "article",
        "ID": "Horcas2019_EneryEfficiencyCPSs"
    },
    {
        "keywords": "Software product line, Evolution, Internet of Things, MAS-PL, Goal models, GORE",
        "abstract": "Multi-agent systems have proved to be a suitable technology for developing self-adaptive Internet of Things (IoT) systems, able to make the most appropriate decisions to address unexpected situations. This leads to new opportunities to use multi-agent technologies to develop all kinds of cyber–physical systems, which usually encompass a high diversity of devices (e.g., new home appliances). The heterogeneity of devices and the high diversity of the available technology, demand the explicit modeling of all kinds of variability for ultra-large systems. However, multi-agent systems lack mechanisms to effectively deal with the different degrees of variability present in these kinds of systems. Software Product Line (SPL) technologies, including variability models, have been successfully applied to different domains to explicitly model variability in hardware, system requirements or user-intended goals. In addition, current market trends are unpredictable, imposing novel technologies, new requirements and goals that must be incorporated immediately into the running systems without damaging them. In this paper, we combine goal-driven and SPL approaches to develop and drive the evolution of multi-agent systems in the context of cyber–physical systems. We propose an SPL process and an evolution process that define a set of models (iStar 2.0 for goals and CVL models for variability) and algorithms to automatically propagate changes to agents running in multiple heterogeneous devices, each of them with a different configuration. We illustrate the proposal in the context of a home energy management system. Finally, we have tested the scalability and performance of the proposal using randomly generated models. The results show that with our approach it is possible to manage huge iStar models of 10000 elements in seconds.",
        "jcr": "Q1 (15/137) Computer Science, Artificial Intelligence. Impact factor: 5.921",
        "month": "nov",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/journals/kbs/AyalaAHF19.bib",
        "timestamp": "Tue, 21 Mar 2023 00:00:00 +0100",
        "doi": "10.1016/J.KNOSYS.2019.104883",
        "url": "https://doi.org/10.1016/j.knosys.2019.104883",
        "year": "2019",
        "specialissue": "New Innovations in Machine Learning and Software Science",
        "volume": "184",
        "journal": "Knowl. Based Syst.",
        "title": "A goal-driven software product line approach for evolving multi-agent systems in the Internet of Things",
        "author": "Inmaculada Ayala and Mercedes Amor and José Miguel Horcas and Lidia Fuentes",
        "ENTRYTYPE": "article",
        "ID": "Ayala2019_GoalDrivenSPLEvolvingMASs"
    },
    {
        "keywords": "SPL in practice, state of practice, tool support, tooling roadmap",
        "abstract": "The lack of mature tool support is one of the main reasons that make the industry to be reluctant to adopt Software Product Line (SPL) approaches. A number of systematic literature reviews exist that identify the main characteristics offered by existing tools and the SPL phases in which they can be applied. However, these reviews do not really help to understand if those tools are offering what is really needed to apply SPLs to complex projects. These studies are mainly based on information extracted from the tool documentation or published papers. In this paper, we follow a different approach, in which we firstly identify those characteristics that are currently essential for the development of an SPL, and secondly analyze whether the tools provide or not support for those characteristics. We focus on those tools that satisfy certain selection criteria (e.g., they can be downloaded and are ready to be used). The paper presents a state of practice with the availability and usability of the existing tools for SPL, and defines different roadmaps that allow carrying out a complete SPL process with the existing tool support.",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/splc/HorcasPF19.bib",
        "timestamp": "Mon, 05 Feb 2024 00:00:00 +0100",
        "doi": "10.1145/3336294.3336304",
        "url": "https://doi.org/10.1145/3336294.3336304",
        "month": "September",
        "address": "Paris, France",
        "year": "2019",
        "volume": "A",
        "publisher": "{ACM}",
        "pages": "25:1--25:13",
        "booktitle": "23rd International Systems and Software Product Line Conference ({SPLC})",
        "title": "Software product line engineering: a practical experience",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2019_SPLEPracticalExperience"
    },
    {
        "keywords": "Energy efficiency, Energy consumption, Quality attributes, Performance, Sustainability, Software product line, Variability",
        "abstract": "Context: Quality attributes play a critical role in the architecture elicitation phase. Software Sustainability and energy efficiency is becoming a critical quality attribute that can be used as a selection criteria to choose from among different design or implementation alternatives. Energy efficiency usually competes with other non-functional requirements, like for instance, performance. Objective: This paper presents a process that helps developers to automatically generate optimum configurations of functional quality attributes in terms of energy efficiency and performance. Functional quality attributes refer to the behavioral properties that need to be incorporated inside a software architecture to fulfill a particular quality attribute (e.g., encryption and authentication for the security quality attribute, logging for the usability quality attribute). Method: Quality attributes are characterized to identify their design and implementation variants and how the different configurations influence both energy efficiency and performance. A usage model for each characterized quality attribute is defined. The variability of quality attributes, as well as the energy efficiency and performance experiment results, are represented as a constraint satisfaction problem with the goal of formally reasoning about it. Then, a configuration of the selected functional quality attributes is automatically generated, which is optimum with respect to a selected objective function. Results: Software developers can improve the energy efficiency and/or performance of their applications by using our approach to perform a richer analysis of the energy consumption and performance of different alternatives for functional quality attributes. We show quantitative values of the benefits of using our approach and discuss the threats to validity. Conclusions: The process presented in this paper will help software developers to build more energy efficient software, whilst also being aware of how their decisions affect other quality attributes, such as performance.",
        "jcr": "Q1 (17/107) Computer Science, Software Engineering. Impact factor: 2.921",
        "month": "mar",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/journals/infsof/HorcasPF18.bib",
        "timestamp": "Mon, 05 Feb 2024 00:00:00 +0100",
        "doi": "10.1016/J.INFSOF.2017.10.018",
        "url": "https://doi.org/10.1016/j.infsof.2017.10.018",
        "year": "2018",
        "pages": "147--164",
        "specialissue": "Automation & Analytics for Greener Software Engineering",
        "volume": "95",
        "journal": "Inf. Softw. Technol.",
        "title": "Variability models for generating efficient configurations of functional quality attributes",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "ENTRYTYPE": "article",
        "ID": "Horcas2018_VariabilityModelsEfficientFQAs"
    },
    {
        "note": "external collaboration, international stay result",
        "keywords": "autonomousvehicles, car-following model, dynamic software product line, reconfiguration, traffic quality",
        "abstract": "Human drivers naturally adapt their behaviour depending on the traffic conditions, such as the current weather and road type. Autonomous vehicles need to do the same, in a way that is both safe and efficient in traffic composed of both conventional and autonomous vehicles. In this paper, we demonstrate the applicability of a reconfigurable vehicle controller agent for autonomous vehicles that adapts the parameters of a used car-following model at runtime, so as to maintain a high degree of traffic quality (efficiency and safety) under different weather conditions. We follow a dynamic software product line approach to model the variability of the car-following model parameters, context changes and traffic quality, and generate specific configurations for each particular context. Under realistic conditions, autonomous vehicles have only a very local knowledge of other vehicles' variables. We investigate a distributed model predictive controller agent for autonomous vehicles to estimate their behavioural parameters at runtime, based on their available knowledge of the system. We show that autonomous vehicles with the proposed reconfigurable controller agent lead to behaviour similar to that achieved by human drivers, depending on the context.",
        "jcr": "Q3 (62/107) Computer Science, Software Engineering. Impact factor: 1.305",
        "month": "apr",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/journals/smr/HorcasMBPFC18.bib",
        "timestamp": "Thu, 09 Sep 2021 01:00:00 +0200",
        "doi": "10.1002/SMR.1926",
        "url": "https://doi.org/10.1002/smr.1926",
        "year": "2018",
        "number": "4",
        "volume": "30",
        "journal": "J. Softw. Evol. Process.",
        "title": "Context-dependent reconfiguration of autonomous vehicles in mixed traffic",
        "author": "José Miguel Horcas and Julien Monteil and Mélanie Bouroche and Mónica Pinto and Lidia Fuentes and Siobhán Clarke",
        "ENTRYTYPE": "article",
        "ID": "Horcas2018_AutonomousVehicles"
    },
    {
        "keywords": "Software Product Line, Self-adaptation, Internet of Things, MAS-PL",
        "abstract": "Advanced smart home appliances and new models of energy tariffs imposed by energy providers pose new challenges in the automation of home energy management. Users need some assistant tool that helps them to make complex decisions with different goals, depending on the current situation. Multi-agent systems have proved to be a suitable technology to develop self-management systems, able to take the most adequate decision under different context-dependent situations, like the home energy management. The heterogeneity of home appliances and also the changes in the energy policies of providers introduce the necessity of explicitly modeling this variability. But, multi-agent systems lack of mechanisms to effectively deal with the different degrees of variability required by these kinds of systems. Software Product Line technologies, including variability models, has been successfully applied to different domains to explicitly model any kind of variability. We have defined a software product line development process that performs a model driven generation of agents embedded in heterogeneous smart objects with different degrees of self-management. However, once deployed, the home energy assistant system has to be able to evolve to self-adapt its decision making or devices to new requirements. So, in this paper we propose a model driven mechanism to automatically manage the evolution of multi-agent systems distributed among several devices.",
        "url": "https://doi.org/10.3233/978-1-61499-900-3-17",
        "timestamp": "Tue, 21 Mar 2023 00:00:00 +0100",
        "doi": "10.3233/978-1-61499-900-3-17",
        "awards": "Best Paper Award",
        "biburl": "https://dblp.org/rec/conf/somet/AyalaAHF18.bib",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "volume": "303",
        "series": "Frontiers in Artificial Intelligence and Applications",
        "publisher": "{IOS} Press",
        "pages": "17--30",
        "month": "September",
        "address": "Granada, Spain",
        "year": "2018",
        "title": "Model Driven Evolution of an Agent-Based Home Energy Management System",
        "booktitle": "17th International Conference on New Trends in Intelligent Software Methodologies, Tools and Techniques ({SoMeT})",
        "author": "Inmaculada Ayala and Mercedes Amor and José Miguel Horcas and Lidia Fuentes",
        "ENTRYTYPE": "inproceedings",
        "ID": "Ayala2018_MDEvolutionABHome"
    },
    {
        "track": "Industrial",
        "note": "external collaboration, industry collaboration",
        "keywords": "Automation, annotations, composition, CVL, SPL, variability, web engineering",
        "abstract": "Web applications development involves managing a high diversity of files and resources like code, pages or style sheets, implemented in different languages. To deal with the automatic generation of custom-made configurations of web applications, industry usually adopts annotation-based approaches even though the majority of studies encourage the use of composition-based approaches to implement Software Product Lines. Recent work tries to combine both approaches to get the complementary benefits. However, technological companies are reticent to adopt new development paradigms such as feature-oriented programming or aspect-oriented programming. Moreover, it is extremely difficult, or even impossible, to apply these programming models to web applications, mainly because of their multilingual nature, since their development involves multiple types of source code (Java, Groovy, JavaScript), templates (HTML, Markdown, XML), style sheet files (CSS and its variants, such as SCSS), and other files (JSON, YML, shell scripts). We propose to use the Common Variability Language as a composition-based approach and integrate annotations to manage fine grained variability of a Software Product Line for web applications. In this paper, we (i) show that existing composition and annotation-based approaches, including some well-known combinations, are not appropriate to model and implement the variability of web applications; and (ii) present a combined approach that effectively integrates annotations into a composition-based approach for web applications. We implement our approach and show its applicability with an industrial real-world system.",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/splc/HorcasCFL18.bib",
        "timestamp": "Tue, 21 Mar 2023 00:00:00 +0100",
        "doi": "10.1145/3233027.3233049",
        "url": "https://doi.org/10.1145/3233027.3233049",
        "month": "September",
        "address": "Gothenburg, Sweden",
        "year": "2018",
        "volume": "1",
        "publisher": "{ACM}",
        "pages": "196--207",
        "booktitle": "22nd International Systems and Software Product Line Conference ({SPLC})",
        "title": "Integrating the common variability language with multilanguage annotations for web engineering",
        "author": "José Miguel Horcas and Alejandro Corti{\\~{n}}as and Lidia Fuentes and Miguel R. Luaces",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2018_CVLMultilanguageAnnotationsWeb"
    },
    {
        "note": "external collaboration",
        "keywords": "energy-efficient applications, self-adaptation, HADAS, Dynamic Software Product Lines, Aspect-Oriented Software Development",
        "abstract": "Software systems have a strong impact on the energy consumption of the hardware they use. For this reason, software developers should be more aware of the energy consumed by their systems. Moreover, software systems should be developed to be able to adapt their behavior to minimize the energy consumed during their execution. This paper illustrates how to address the problem of developing self-adaptive energy-efficient applications using the HADAS approach. HADAS makes use of advanced software engineering methods, such as Dynamic Software Product Lines and Aspect-Oriented Software Development. The main steps of the HADAS approach, both during the design of the application and also at runtime are illustrated by applying them to a running case study.",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/dasc/HorcasPFG17.bib",
        "timestamp": "Thu, 23 Mar 2023 00:00:00 +0100",
        "doi": "10.1109/DASC-PICOM-DATACOM-CYBERSCITEC.2017.140",
        "url": "https://doi.org/10.1109/DASC-PICom-DataCom-CyberSciTec.2017.140",
        "month": "November",
        "address": "Orlando, FL, USA",
        "year": "2017",
        "publisher": "{IEEE} Computer Society",
        "pages": "828--835",
        "booktitle": "15th IEEE International Conference on Pervasive Intelligence and Computing ({PICom})",
        "title": "Self-Adaptive Energy-Efficent Applications: The {HADAS} Developing Approach",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes and Nadia Gámez",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2017_HADASApproach"
    },
    {
        "keywords": "CVL, Software Product Line, Variability",
        "abstract": "The Common Variability Language (CVL) has become a reference in the specification and resolution of variability in the last few years. Despite the multiple advantages of CVL (orthogonal variability, architecture variability resolution, MOF-compliant, standard proposed,...), several approaches require extending and/or modifying the CVL approach in different ways in order to fulfill the industrial needs for variability modeling in Software Product Lines. However, the community lacks a tool that would enable proposed extensions and the integration of novel approaches to be put into practice. Existing tools that provide support for CVL are incomplete or are mainly focused on the variability model's editor, instead of executing the resolution of the variability over the base models. Moreover, there is no API that allows direct interaction with the CVL engine to extend or use it in an independent application. In this paper, we identify the extension points of the CVL approach with the goal of making the CVL engine more flexible, and to help software architects in the task of resolving the variability of their products. The practical tool presented here is a working implementation of the CVL engine, that can be extended through a proposed API.",
        "track": "tool",
        "url": "https://doi.org/10.1145/3109729.3109749",
        "timestamp": "Tue, 06 Aug 2024 17:12:58 +0200",
        "doi": "10.1145/3109729.3109749",
        "awards": "Hitachi Young Best Paper Award",
        "biburl": "https://dblp.org/rec/conf/splc/HorcasPF17a.bib",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "volume": "B",
        "publisher": "{ACM}",
        "pages": "32--37",
        "month": "September",
        "address": "Sevilla, Spain",
        "year": "2017",
        "title": "Extending the Common Variability Language {(CVL)} Engine: {A} practical tool",
        "booktitle": "21st International Systems and Software Product Line Conference ({SPLC})",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2017_vEXgine"
    },
    {
        "keywords": "Quality Attributes, Energy Consumption, FQA, SPL, Variability",
        "abstract": "Functional quality attributes (FQAs) are those quality attributes that, to be satisfied, require the incorporation of additional functionality into the application architecture. By adding an FQA (e.g., security) we can improve the quality of the final product, but there is also an increase in energy consumption. This paper proposes a solution to help the software architect to generate configurations of FQAs whilst keeping the energy consumed by the application as low as possible. For this, a usage model is defined for each FQA, taking into account the variables that affect the energy consumption, and that the values of these variables change according to the part of the application where the FQA is required. We extend a Software Product Line that models a family of FQAs to incorporate the variability of the usage model and the existing frameworks that implement FQAs. We generate the most eco-efficient configuration of FQAs by selecting the framework with the most suitable characteristics according to the requirements of the application.",
        "track": "short",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/splc/HorcasPF17.bib",
        "timestamp": "Mon, 05 Feb 2024 00:00:00 +0100",
        "doi": "10.1145/3106195.3106205",
        "url": "https://doi.org/10.1145/3106195.3106205",
        "month": "September",
        "address": "Sevilla, Spain",
        "year": "2017",
        "volume": "A",
        "publisher": "{ACM}",
        "pages": "79--83",
        "booktitle": "21st International Systems and Software Product Line Conference ({SPLC})",
        "title": "Green Configurations of Functional Quality Attributes",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2017_GreenConfigurations"
    },
    {
        "note": "external collaboration, industry collaboration",
        "keywords": "Aspect-oriented programming, Dynamic deployment, Monitoring, Security framework, Security policies",
        "abstract": "Security policies are enforced through the deployment of certain security functionalities within the applications. When the security policies dynamically change, the associated security functionalities currently deployed within the applications must be adapted at runtime in order to enforce the new security policies. INTER-TRUST is a framework for the specification, negotiation, deployment and dynamic adaptation of interoperable security policies, in the context of pervasive systems where devices are constantly exchanging critical information through the network. The dynamic adaptation of the security policies at runtime is addressed using Aspect-Oriented Programming (AOP) that allows enforcing security requirements by dynamically weaving security aspects into the applications. However, a mechanism to guarantee the correct adaptation of the functionality that enforces the changing security policies is needed. In this paper, we present an approach based on the combination of monitoring and detection techniques in order to maintain the correlation between the security policies and the associated functionality deployed using AOP, allowing the INTER-TRUST framework to automatically react when needed.",
        "jcr": "Q2 (37/146) Computer Science, Information Systems. Impact factor: 2.849",
        "month": "may",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/journals/compsec/HorcasPFMO16.bib",
        "timestamp": "Mon, 05 Feb 2024 00:00:00 +0100",
        "doi": "10.1016/J.COSE.2015.11.007",
        "url": "https://doi.org/10.1016/j.cose.2015.11.007",
        "year": "2016",
        "pages": "20--38",
        "volume": "58",
        "journal": "Comput. Secur.",
        "title": "An approach for deploying and monitoring dynamic security policies",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes and Wissam Mallouli and Edgardo Montes de Oca",
        "ENTRYTYPE": "article",
        "ID": "Horcas2016_DynamicSecurityPolicies"
    },
    {
        "keywords": "Quality attributes, Software product lines, Weaving",
        "abstract": "Some quality attributes can be modelled using software components, and are normally known as Functional Quality Attributes (FQAs). Applications may require different FQAs, and each FQA (e.g., security) can be composed of many concerns (e.g., access control or authentication). They normally have dependencies between them and crosscut the system architecture. The goal of the work presented here is to provide the means for software architects to focus only on application functionality, without having to worry about FQAs. The idea is to model FQAs separately from application functionality following a Software Product Line (SPL) approach. By combining SPL and aspect-oriented mechanisms, we will define a generic process to model and automatically inject FQAs into the application without breaking the base architecture. We will provide and compare two implementations of our generic approach using different variability and architecture description languages: (i) feature models and an aspect-oriented architecture description language; and (ii) the Common Variability Language (CVL) and a MOF-compliant language (e.g., UML). We also discuss the benefits and limitations of our approach. Modelling FQAs separately from the base application has many advantages (e.g., reusability, less coupled components, high cohesive architectures).",
        "jcr": "Q1 (22/106) Computer Science, Software Engineering. Impact factor: 2.444",
        "month": "feb",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/journals/jss/HorcasPF16.bib",
        "timestamp": "Mon, 05 Feb 2024 00:00:00 +0100",
        "doi": "10.1016/J.JSS.2015.11.005",
        "url": "https://doi.org/10.1016/j.jss.2015.11.005",
        "year": "2016",
        "pages": "78--95",
        "volume": "112",
        "journal": "J. Syst. Softw.",
        "title": "An automatic process for weaving functional quality attributes using a software product line approach",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "ENTRYTYPE": "article",
        "ID": "Horcas2016_WeavingFQAsSPLProcess"
    },
    {
        "abstract": "Los atributos de calidad funcionales (FQA) son aquellos que tienen una clara implicación en la funcionalidad del sistema, es decir, existen unos componentes específicos que deben ser incorporados a la arquitectura software del sistema para satisfacer sus requisitos de atributos de calidad. Ejemplos de FQAs son seguridad, usabilidad, o persistencia. Modelar estos atributos es una tarea compleja. Por un lado, se componen de muchas características relacionadas, por ejemplo seguridad está compuesto, entre otros, por autenticación, confidencialidad y encriptación. Tienen dependencias entre ellos, por ejemplo, seguridad puede ser requerido por usabilidad o persistencia. Por otro lado, tienen muchos puntos de variabilidad: una aplicación concreta puede requerir autenticación y control de acceso mientras que otra puede necesitar sólo encriptación. Además, su funcionalidad suele estar dispersa afectando a varios componentes del sistema en desarrollo. El objetivo de esta tesis es definir una línea de productos software orientada a aspectos que permita: (1) modelar las similitudes y la variabilidad de los FQAs desde las primeras etapas del proceso de desarrollo, (2) gestionar las dependencias existentes entre los FQAs, (3) independizar el modelado de los FQAs de la arquitectura de la aplicación afectada, (4) configurar los FQAs en base a los requisitos de cada aplicación teniendo además en cuenta propiedades no funcionales como el rendimiento y el consumo energético de cada solución, (5) incorporar las configuraciones a la arquitectura de la aplicación de manera automática; y (6) gestionar la evolución de los FQAs cuando los requisitos cambien en el futuro. Como resultado se ha definido WeaFQAs, un proceso software para gestionar los FQAs que cubre todos los puntos mencionados. Se han realizado y comparado dos instanciaciones de WeaFQAs usando diferentes lenguajes de variabilidad y de modelado, además de proporcionar soporte con una herramienta basada en el lenguaje CVL. ",
        "address": "Málaga, España",
        "calification": "Cum Laude",
        "awards": "Premio nacional SISTEDES 2020, Premio extraordinario doctorado",
        "url": "https://hdl.handle.net/10630/17231",
        "month": "July",
        "year": "2018",
        "title": "{WeaFQAs}: {A} Software Product Line Approach for Customizing and Weaving Efficient Functional Quality Attributes",
        "school": "Universidad de Málaga",
        "author": "Jose Miguel Horcas",
        "ENTRYTYPE": "phdthesis",
        "ID": "Horcas2018_WeaFQAs"
    },
    {
        "keywords": "Quality attributes, reconfiguration, software architecture, SPL, variability",
        "abstract": "There are some Quality Attributes (QAs) whose variability is addressed through functional variability in the software architecture. Separately modelling the variability of these QAs from the variability of the base functionality of the application has many advantages (e.g., a better reusability), and facilitates the reconfiguration of the QA variants at runtime. Many factors may vary the QA functionality: variations in the user preferences and usage needs; variations in the non-functional QAs; variations in resources, hardware, or even in the functionality of the base application, that directly affect the product's QAs. In this paper, we aim to elicit the relationships and dependencies between the functionalities required to satisfy the QAs and all those factors that can provoke a reconfiguration of the software architecture at runtime. We follow an approach in which the variability of the QAs is modelled separately from the base application functionality, and propose a dynamic approach to reconfigure the software architecture based on those reconfiguration criteria.",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/aosd/HorcasPF16.bib",
        "timestamp": "Mon, 05 Feb 2024 00:00:00 +0100",
        "doi": "10.1145/2892664.2892686",
        "url": "https://doi.org/10.1145/2892664.2892686",
        "month": "March",
        "address": "Málaga, Spain",
        "year": "2016",
        "publisher": "{ACM}",
        "pages": "131--136",
        "booktitle": "1st Workshop on Live Adaptation of Software SYstems ({LASSY} @ {MODULARITY})",
        "title": "Towards the dynamic reconfiguration of quality attributes",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2016_DynamicReconfigurationQAs"
    },
    {
        "note": "external collaboration",
        "keywords": "Aspect-Orientation, Model-Driven Development, Quality Attributes, Weaving Patterns",
        "abstract": "The quality of a software system can be measured by the extent to which it possesses a desired combination of quality attributes (QAs). While some QAs are achieved implicitly through the interaction of various functional components of the system, others (e.g., security) can be encapsulated in dedicated software components. These QAs are known as functional quality attributes (FQAs). As applications may require different FQAs, and each FQA can be composed of many concerns (e.g., access control and authentication), integrating FQAs is very complex and requires dedicated expertise. Software architects are required to manually define FQA components, identify appropriate points in their architecture where to weave them, and verify that the composition of these FQA components with the other components is correct. This is a complex and error prone process. In our previous work we defined reusable FQAs by encapsulating them as aspectual architecture models that can be woven into a base architecture. So far, the joinpoints for weaving had to be identified manually. This made it difficult for software architects to verify that they have woven all the necessary FQAs into all the right places. In this paper, we address this problem by introducing a notion of contract for FQAs so that the correct application of an FQA (or one of its concerns) can be checked or, alternatively, appropriate binding points can be identified and proposed to the software architect automatically.",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/aosd/HorcasPFZ16.bib",
        "timestamp": "Mon, 05 Feb 2024 00:00:00 +0100",
        "doi": "10.1145/2892664.2892700",
        "url": "https://doi.org/10.1145/2892664.2892700",
        "month": "March",
        "address": "Málaga, Spain",
        "year": "2016",
        "publisher": "{ACM}",
        "pages": "201--205",
        "booktitle": "1st International Modularity in Modelling Workshop ({MOMO} @ {MODULARITY})",
        "title": "Towards contractual interfaces for reusable functional quality attribute operationalisations",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes and Steffen Zschaler",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2016_ContractualInterfacesFQAsOperationalizations"
    },
    {
        "abstract": "Cloud computing is becoming the predominant mechanism to seamlessly deploy applications with special requirements such as massive storage sharing or load balancing, usually provided as services by cloud platforms. A developer can improve the application's delivery and productivity by following a multi tenancy approach, where variants of the same application can be quickly customized to the necessities of each tenant. However, managing the inherent variability existing in multi-tenant applications and, even more importantly, managing the evolution of a multi-tenant application with hundreds of tenants and thousands of different valid architectural configurations can become intractable if performed manually. In this paper we propose a product line architecture approach in which: (1) we use cardinality-based variability models to model each tenant as a clonable feature, (2) we automate the process of evolving the multi- tenant application architecture, and (3) we demonstrate that the implemented process is correct and efficient for a high number of tenants in a reasonable time. We use a running case study in the domain of medical software.",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/edoc/HorcasPF16.bib",
        "timestamp": "Mon, 05 Feb 2024 00:00:00 +0100",
        "doi": "10.1109/EDOC.2016.7579384",
        "url": "https://doi.org/10.1109/EDOC.2016.7579384",
        "month": "September",
        "address": "Vienna, Austria",
        "year": "2016",
        "publisher": "{IEEE} Computer Society",
        "pages": "1--10",
        "booktitle": "20th {IEEE} International Enterprise Distributed Object Computing Conference ({EDOC})",
        "title": "Product Line Architecture for Automatic Evolution of Multi-Tenant Applications",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2016_PLAEvolutionMultiTenants"
    },
    {
        "keywords": "Software Product Lines, Dynamic Software Product Lines, Goal-oriented, Internet of Things, Preference-based reasoning",
        "abstract": "One of the most important challenges of this decade is the Internet of Things (IoT) that pursues the integration of real-world objects in the virtual world of the Internet. One property that characterises IoT systems is that they have to react to variable and continuous changes. This means that IoT systems need to work as self-managed systems to effectively manage context changes. The autonomy property inherent to software agents makes them a suitable choice for developing self-managed IoT systems. By embedding agents in the devices that compose the IoT is possible to realize a decentralized system with self-management capacities. However, in this scenario new problems arise. Firstly, current agent development approaches lack mechanisms to deal with the heterogeneity present in the IoT domain. Secondly, agents must simultaneously deal with potentially conflicting changes in their behaviour, concerning self-management and application goals. In order to afford these challenges we propose to use an approach based on Dynamic Software Product Lines (D-SPL) and preference-based reasoning. The D-SPL provides to the preference-based reasoning of the agent with the necessary information to adapt its behaviour at runtime making a trade-off between the self-management of the system and the accomplishment of its application goals.",
        "url": "https://doi.org/10.1007/978-3-319-45889-2_12",
        "timestamp": "Thu, 09 Sep 2021 01:00:00 +0200",
        "doi": "10.1007/978-3-319-45889-2_12",
        "awards": "Best Paper Award",
        "biburl": "https://dblp.org/rec/conf/mates/AyalaHAF16.bib",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "volume": "9872",
        "series": "Lecture Notes in Computer Science",
        "publisher": "Springer",
        "pages": "155--173",
        "month": "September",
        "address": "Klagenfurt, Austria",
        "year": "2016",
        "title": "Using Models at Runtime to Adapt Self-managed Agents for the IoT",
        "booktitle": "14th German Conference on Multiagent System Technologies ({MATES})",
        "author": "Inmaculada Ayala and José Miguel Horcas and Mercedes Amor and Lidia Fuentes",
        "ENTRYTYPE": "inproceedings",
        "ID": "Ayala2016_ModelsRuntimeAgentsIoT"
    },
    {
        "keywords": "Encryption, Security pattern, Software architecture, SPL",
        "abstract": "Ensuring the security requirements of an application is not a straightforward task. Security properties (e.g., confidentiality, anonymity) need to be satisfied in different ways in different parts of the same application. Software architects are usually required to manually define security components and their dependencies with the base application, customize them to the application’s requirements, identify the points where security is incorporated, and verify that the selected places are correct. The last two steps are especially complex and error-prone. In our approach, we aim to provide a solution that helps software architects to identify the correct places to incorporate the security functionality and to verify the correctness of the composed application architecture. This is achieved by identifying a set of general structural patterns for incorporating security into the application architecture, and by providing a model-driven SPL solution to customize these patterns to each application’s requirements.",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/trustbus/HorcasPF16.bib",
        "timestamp": "Mon, 05 Feb 2024 00:00:00 +0100",
        "doi": "10.1007/978-3-319-44341-6_2",
        "url": "https://doi.org/10.1007/978-3-319-44341-6_2",
        "month": "sep",
        "address": "Porto, Portugal",
        "year": "2016",
        "publisher": "Springer",
        "pages": "19--31",
        "volume": "9830",
        "series": "Lecture Notes in Computer Science",
        "booktitle": "13th International Conference On Trust, Privacy & Security In Digital Business ({TrustBus})",
        "title": "Automatic Enforcement of Security Properties",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2016_SecurityProperties"
    },
    {
        "keywords": "FamiWare, INTER-TRUST, self-protection, self-adaptation, security frameworks, dynamic software product lines",
        "abstract": "Providing security and privacy to wireless sensor nodes (WSNs) is very challenging, due to the heterogeneity of sensor nodes and their limited capabilities in terms of energy, processing power and memory. The applications for these systems run in a myriad of sensors with different low-level programming abstractions, limited capabilities and different routing protocols. This means that applications for WSNs need mechanisms for self-adaptation and for self-protection based on the dynamic adaptation of the algorithms used to provide security. Dynamic software product lines (DSPLs) allow managing both variability and dynamic software adaptation, so they can be considered a key technology in successfully developing self-protected WSN applications. In this paper, we propose a self-protection solution for WSNs based on the combination of the INTER-TRUST security framework (a solution for the dynamic negotiation and deployment of security policies) and the FamiWare middleware (a DSPL approach to automatically configure and reconfigure instances of a middleware for WSNs). We evaluate our approach using a case study from the intelligent transportation system domain. ",
        "jcr": "Q1 (12/56) Instruments & Instrumentation. Impact factor: 2.033",
        "month": "mar",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/journals/sensors/PintoGFAHA15.bib",
        "timestamp": "Mon, 03 Jan 2022 00:00:00 +0100",
        "doi": "10.3390/S150305251",
        "url": "https://doi.org/10.3390/s150305251",
        "year": "2015",
        "pages": "5251--5280",
        "number": "3",
        "volume": "15",
        "specialissue": "Wireless Sensor Networks and the Internet of Things",
        "journal": "Sensors",
        "title": "Dynamic Reconfiguration of Security Policies in Wireless Sensor Networks",
        "author": "Mónica Pinto and Nadia Gámez and Lidia Fuentes and Mercedes Amor and José Miguel Horcas and Inmaculada Ayala",
        "ENTRYTYPE": "article",
        "ID": "Pinto2015_DynamicReconfigurationSecurityPoliciesSensorNetworks"
    },
    {
        "note": "external collaboration, industry collaboration",
        "keywords": "Aspect-oriented programming, Dynamic deployment, Monitoring, Security policies",
        "abstract": "INTER-TRUST is a framework for the specification, negotiation, deployment and dynamic adaptation of interoperable security policies, in the context of pervasive systems where devices are constantly exchanging critical information through the network. The dynamic adaptation of the security policies at runtime is addressed using Aspect-Oriented Programming (AOP) that allows enforcing security requirements by dynamically weaving security aspects into the applications. However, a mechanism to guarantee the correct adaptation of the functionality that enforces the changing security policies is needed. In this paper, we present an approach with monitoring and detection techniques in order to maintain the correlation between the security policies and the associated functionality deployed using AOP, allowing the INTER-TRUST framework automatically reacts when needed.",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/trustbus/HorcasPFMO15.bib",
        "timestamp": "Mon, 05 Feb 2024 00:00:00 +0100",
        "doi": "10.1007/978-3-319-22906-5_14",
        "url": "https://doi.org/10.1007/978-3-319-22906-5_14",
        "month": "September",
        "address": "Valencia, Spain",
        "year": "2015",
        "publisher": "Springer",
        "pages": "180--192",
        "volume": "9264",
        "series": "Lecture Notes in Computer Science",
        "booktitle": "12th International Conference On Trust, Privacy & Security In Digital Business ({TrustBus})",
        "title": "Dynamic Deployment and Monitoring of Security Policies",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes and Wissam Mallouli and Edgardo Montes de Oca",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2015_DynamicSecurityPolicies"
    },
    {
        "keywords": "CVL, quality attributes, SPL, variability, weaving",
        "abstract": "Quality attributes that add new behavior to the functional software architecture are known as functional quality attributes (FQAs). These FQAs are applied to pieces of software from small components to entire systems, usually crosscutting some of them. Due to this crosscutting nature, modeling them separately from the base application has many advantages (e.g. reusability, less coupled architectures). However, different applications may require different configurations of an FQA (e.g. different levels of security), so we need a language that: (i) easily expresses the variability of the FQAs at the architectural level; and that (ii) also facilitates the automatic generation of architectural configurations with custom-made FQAs. In this sense, the Common Variability Language (CVL) is extremely suited for use at the architectural level, not requiring the use of a particular architectural language to model base functional requirements. In this paper we propose a method based on CVL to: (i) model separately and generate FQAs customized to the application requirements; (ii) automatically inject customized FQA components into the architecture of the applications. We quantitatively evaluate our approach and discuss its benefits with a case study.",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/cbse/HorcasPF14.bib",
        "timestamp": "Thu, 09 Sep 2021 01:00:00 +0200",
        "doi": "10.1145/2602458.2602460",
        "url": "https://doi.org/10.1145/2602458.2602460",
        "month": "June",
        "address": "Lille, France",
        "year": "2014",
        "publisher": "{ACM}",
        "pages": "35--44",
        "booktitle": "17th International ACM SIGSOFT Symposium on Component-Based Software Engineering ({CBSE})",
        "title": "Injecting quality attributes into software architectures with the common variability language",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horas2014_InjectingQAsCVL"
    },
    {
        "keywords": "Security enforcement, Security policy, Aspect-Oriented Programming, Dynamicity",
        "abstract": "The security policies of an application can change at runtime due to several reasons, as for example the changes on the user preferences, the lack of enough resources in mobile environments or the negotiation of security levels between the interacting parties. As these security policies change, the application code that copes with the security functionalities should be adapted in order to enforce at runtime the changing security policies. In this paper we present the design, implementation and evaluation of a runtime security adaptation service. This service is based on the combination of autonomic computing and aspect-oriented programming, where the security functionalities are implemented as aspects that are dynamically configured, deployed or un-deployed by generating and executing a security adaptation plan. This service is part of the INTER-TRUST framework, a complete solution for the definition, negotiation and run-time enforcement of security policies.",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/ecsa/HorcasPF14.bib",
        "timestamp": "Mon, 05 Feb 2024 00:00:00 +0100",
        "doi": "10.1007/978-3-319-09970-5_29",
        "url": "https://doi.org/10.1007/978-3-319-09970-5_29",
        "month": "August",
        "address": "Vienna, Austria",
        "year": "2014",
        "publisher": "Springer",
        "pages": "340--356",
        "volume": "8627",
        "series": "Lecture Notes in Computer Science",
        "booktitle": "8th European Conference on Software Architecture ({ECSA})",
        "title": "Runtime Enforcement of Dynamic Security Policies",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2014_DynamicSecurityPolicies"
    },
    {
        "keywords": "Aspect-Orientation, ATL, CVL, Model Transformations, Security, Variability, Weaving Pattern",
        "abstract": "In this paper, we combine the Common Variability Language (CVL) and the ATL Transformation Language to customize and incorporate a generic security model into any application that requires security. Security spans a large set of concerns such as integrity, encryption or authentication, among others, and each concern needs to be incorporated into the base application in a different way and at different points of the application. We propose a set of weaving patterns using model transformations in ATL to automatically weave the security concerns with the base application in an aspect-oriented way. Since different applications require different security requirements, the security model needs to be customized before its incorporation into the application. We resolve the variability of the security properties and implement the weaving process in CVL. We use an e-voting case study to illustrate our proposal using the CVL approach.",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/modelsward/HorcasPF14.bib",
        "timestamp": "Mon, 05 Feb 2024 00:00:00 +0100",
        "doi": "10.5220/0004890601380147",
        "url": "https://doi.org/10.5220/0004890601380147",
        "month": "January",
        "address": "Lisbon, Portugal",
        "year": "2014",
        "publisher": "SciTePress",
        "pages": "138--147",
        "booktitle": "2nd International Conference on Model-Driven Engineering and Software Development ({MODELSWARD})",
        "title": "An Aspect-Oriented Model Transformation to Weave Security using {CVL}",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2014_AOMTWeavingSecurityCVL"
    },
    {
        "keywords": "Security enforcement, security policy, aspect-oriented programming, software product lines",
        "abstract": "Security policies are enforced through the deployment of certain security functionalities within the applications. Applications can have different levels of security and thus each security policy is enforced by different security functionalities. Thus, the secure deployment of an application is not an easy task, being more complicated due to the existing gap between the specification of a security policy and the deployment, inside the application, of the security functionalities that are required to enforce that security policy. The main goal of this paper is to close this gap. This is done by using the paradigms of Software Product Lines and Aspect-Oriented Programming in order to: (1) link the security policies with the security functionalities, (2) generate a configuration of the security functionalities that fit a security policy, and (3) weave the selected security functionalities into an application. We qualitatively evaluate our approach, and discuss its benefits using a case study.",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/trustbus/HorcasPF14.bib",
        "timestamp": "Thu, 09 Sep 2021 01:00:00 +0200",
        "doi": "10.1007/978-3-319-09770-1_10",
        "url": "https://doi.org/10.1007/978-3-319-09770-1_10",
        "month": "September",
        "address": "Munich, Germany",
        "year": "2014",
        "publisher": "Springer",
        "pages": "106--118",
        "volume": "8647",
        "series": "Lecture Notes in Computer Science",
        "booktitle": "11th International Conference On Trust, Privacy & Security In Digital Business ({TrustBus})",
        "title": "Closing the Gap between the Specification and Enforcement of Security Policies",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2014_ClosingGapSecurityPolicies"
    },
    {
        "keywords": "",
        "abstract": "In the last few years several new programming techniques for achieving a better separation of concerns have been defined. One of the most accepted has been Aspect-Oriented Programming (AOP). Those attending this tutorial will learn how to improve the modularization, maintainability and evolution of secure applications by using AOP to achieve a better separation of the security concerns (e.g. authentication, authorization, encryption). A running example will be used throughout the tutorial to illustrate how AOP works. The tutorial will principally illustrate the use of the AspectJ programming language, although other AOP languages will be used to cover features that are not included in AspectJ. As a proof of concept we will discuss the use of AOP in the context of the INTER-TRUST project, a STREP project that brings together experts from the security and aspect-oriented research communities to demonstrate that security policies can be dynamically deployed and adapted at runtime using AOP.",
        "track": "tutorial",
        "url": "https://doi.org/10.1109/CRiSIS.2013.6766345",
        "timestamp": "Fri, 24 Mar 2023 00:00:00 +0100",
        "doi": "10.1109/CRISIS.2013.6766345",
        "biburl": "https://dblp.org/rec/conf/crisis/PintoH13.bib",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "publisher": "{IEEE} Computer Society",
        "pages": "1--3",
        "month": "October",
        "address": "La Rochelle, France",
        "year": "2013",
        "title": "How to develop secure applications with Aspect-Oriented Programming",
        "booktitle": "8th International Conference on Risks and Security of Internet and Systems ({CRiSIS})",
        "author": "Mónica Pinto and José Miguel Horcas",
        "ENTRYTYPE": "inproceedings",
        "ID": "Pinto2013_TutorialSecurityAOP"
    },
    {
        "keywords": "AO-ADL, dependencies, feature models, quality attributes",
        "abstract": "Functional Quality Attributes (FQAs) are quality attributes that have strong functional implications and so can be easily modeled by software components. Thus, we use an aspect-oriented software product line approach, to model the commonalities and variabilities of FQAs from the early stages of the software development. However, FQAs cannot be modeled in isolation since they usually have dependencies and interactions between them. In this paper we focus on identifying and modeling the dependencies among different FQAs. These dependencies are automatically incorporated into the final software architecture of the system under development, even when the software architect may be unaware of them.",
        "track": "short",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/euromicro/HorcasPF13.bib",
        "timestamp": "Fri, 24 Mar 2023 00:00:00 +0100",
        "doi": "10.1109/SEAA.2013.20",
        "url": "https://doi.org/10.1109/SEAA.2013.20",
        "month": "September",
        "address": "Santander, Spain",
        "year": "2013",
        "publisher": "{IEEE} Computer Society",
        "pages": "185--188",
        "booktitle": "39th Euromicro Conference on Software Engineering and Advanced Applications ({Euromicro SEAA})",
        "title": "Variability and Dependency Modeling of Quality Attributes",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2013_VariabilityDependencyModelingQAs"
    },
    {
        "keywords": "functional quality attributes, variability, SPL, AOSD, MDD, dynamic reconfiguration",
        "abstract": "Modeling Functional Quality Attributes (FQAs) and the relationships between them is a complex task for several reasons. In order to cope with that complexity, our research focuses on defining an aspect-oriented software product line approach that: (1) models the commonalities and variabilities of FQAs from the early stages of the development process using a software product line approach, (2) weaves the FQA configurations with the core functionality of applications in an aspectoriented fashion, (3) specifies the FQAs in a generic way, making it possible to use our approach with any MOF-compliant modeling language, and (4) adapts the FQA configurations at runtime according to changes in the application execution environment.",
        "track": "PhD Symposium",
        "url": "https://info-web.lirmm.fr/ecoop13/images/ds/4-paper-jose%20miguel%20horcas%20aguilera.pdf",
        "month": "jul",
        "address": "Montpellier, France",
        "year": "2013",
        "booktitle": "7th European Conference on Software Architecture ({ECSA}), {Doctoral Symposium: PhD Students Worshop}",
        "title": "Modeling of Quality Attributes using an Aspect-Oriented Software-Product Line approach",
        "author": "José Miguel Horcas",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2013_ModelingQAsAOSPL"
    },
    {
        "note": "external collaboration",
        "keywords": "Decision making support, Feature model, Software product line, Belief uncertainty, Subjective logic, Evolution, Next release problem, Variability reduction",
        "abstract": "Software Product Lines (SPL) are not static software artifacts, but they evolve over time. The planning, realization, and release of a SPL requires many high-level decisions involving many different stakeholders with different expertise. Taking their opinions into account to make the right decisions is not trivial. Currently there are no mechanisms to assist stakeholders in the decision making process in an informed manner. In this paper, we propose the use of belief uncertainty in conjunction with feature models to assist in the evolution of SPLs by explicitly quantifying opinions and their associated uncertainty. We present a novel approach in which subjective logic is used to represent the opinions of stakeholders in three evolution scenarios, namely feature model evolution, next release problem and variability reduction. We apply our approach to the evolution of the Xiaomi MiBand SmartWatch SPL over the time period from July 2014 to October 2023. We present an implementation of our approach and evaluate its scalability.",
        "jcr": "Q1 (23/128) Computer Science, Software Engineering. Impact factor: 4.1",
        "month": "jan",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/journals/jss/HorcasBK25.bib",
        "timestamp": "Mon, 09 Dec 2024 22:47:38 +0100",
        "doi": "10.1016/J.JSS.2024.112235",
        "url": "https://doi.org/10.1016/j.jss.2024.112235",
        "year": "2025",
        "pages": "112235",
        "specialissue": "SPLC 2023 Special Issue on Intelligent Software Product Lines",
        "volume": "219",
        "journal": "J. Syst. Softw.",
        "title": "Leveraging belief uncertainty for informed decision making in software product line evolution",
        "author": "José Miguel Horcas and Lola Burgueño and Jörg Kienzle",
        "ENTRYTYPE": "article",
        "ID": "Horcas2025_BeliefUncertainty"
    },
    {
        "note": "external collaboration",
        "keywords": "Feature models, Software product line, Variability, Dataset, UVL",
        "abstract": "Feature models are the de facto standard for modelling variabilities and commonalities in features and relationships in software product lines. They are the base artefacts in many engineering activities, such as product configuration, derivation, or testing. Concrete models in different domains exist; however, many are in private or sparse repositories or belong to discontinued projects. The dispersion of knowledge of feature models hinders the study and reuse of these artefacts in different studies. The Universal Variability Language (UVL) is a community effort textual feature model language that promotes a common way of serializing feature models independently of concrete tools. Open science principles promote transparency, accessibility, and collaboration in scientific research. Although some attempts exist to promote feature model sharing, the existing solutions lack open science principles by design. In addition, existing and public feature models are described using formats not always supported by current tools. This paper presents , a repository of feature models in UVL format. provides a front end that facilitates the search, upload, storage, and management of feature model datasets, improving the capabilities of discontinued proposals. Furthermore, the tool communicates with Zenodo – one of the most well-known open science repositories – providing a permanent save of datasets and following open science principles. includes existing datasets and is readily available to include new data and functionalities in the future. It is maintained by three active universities in variability modelling.",
        "jcr": "Q1 (23/128) Computer Science, Software Engineering. Impact factor: 4.1",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/journals/jss/RomeroOrganvidezGSHB24.bib",
        "timestamp": "Mon, 09 Dec 2024 22:47:38 +0100",
        "doi": "10.1016/J.JSS.2024.112150",
        "url": "https://doi.org/10.1016/j.jss.2024.112150",
        "year": "2024",
        "pages": "112150",
        "month": "oct",
        "specialissue": "Special Issue on open science in Software Engineering research",
        "volume": "216",
        "journal": "J. Syst. Softw.",
        "title": "UVLHub: {A} feature model data repository using {UVL} and open science principles",
        "author": "David Romero-Organvidez and José A. Galindo and Chico Sundermann and José Miguel Horcas and David Benavides",
        "ENTRYTYPE": "article",
        "ID": "RomeroOrganvidez2024_UVLHub"
    },
    {
        "keywords": "Configuration, documentation, Kubernetes, feature model, variability synthesis, manifest files, YAML",
        "abstract": "Kubernetes is widely adopted across the Cloud, Edge and IoT Continuum to orchestrate containerized applications efficiently, from centralized clouds to edge devices and IoT endpoints. Managing configuration variability in platforms like Kubernetes remains challenging due to a wide range of options that, while documented, are often implicit in configuration files. This complexity limits the use of many features, with most configurations employing only a subset of available options, forcing developers to study extensive manuals to understand configurable parameters and their variants. This paper presents a synthesized variability model for Kubernetes, derived directly from its official documentation rather than from existing configurations. The resulting feature model captures the configuration space and its constraints, enabling the automatic generation of tailored, consistent configurations that reduce manual effort and ensure compatibility across platform versions. We validate the model against over 250,000 real-world configurations to confirm its effectiveness.",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/conf/vamos/HorcasPF25.bib",
        "timestamp": "Fri, 30 May 2025 11:26:47 +0200",
        "doi": "10.1145/3715340.3715440",
        "url": "https://doi.org/10.1145/3715340.3715440",
        "year": "2025",
        "publisher": "{ACM}",
        "pages": "58--67",
        "month": "Feb",
        "address": "Rennes, France",
        "booktitle": "19th International Working Conference on Variability Modelling of Software-Intensive Systems ({VaMoS})",
        "title": "The Kubernetes variability model: Synthesizing variability from the K8s {API} Documentation: {A} case study",
        "author": "José Miguel Horcas and Mercedes Amor Pinilla and Lidia Fuentes",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2025_KubernetesFM"
    },
    {
        "keywords": "Software;Cloud computing;Computer architecture;Biological system modeling;Energy consumption;Adaptation models;Silicon compounds;Cardinality;Energy Efficiency;Evolution;Product Line Architecture;Variability;CVL",
        "abstract": "Resource sharing and mass storage in server farms provided by cloud platforms save huge amounts of energy. However, optimizing energy consumption at the server room is not enough, being desirable to perform energy optimization of cloud services at the application level. In cloud computing a tailored configuration of services is deployed for each client (tenant), requiring different energy consumption optimizations. Indeed, energy consumption of cloud services depends on several factors determined by the context and usage of the applications. So, to evolve a cloud application to new requirements of energy efficiency implies to perform custom-made adaptations for each tenant. Thus, managing the evolution of a multi-tenant application with hundreds of tenants and thousands of different valid architectural configurations can become intractable if performed manually. This paper proposes a product line architecture approach that: (1) uses cardinality-based variability models to model each tenant as a clonable feature, and (2) automatizes the process of evolving the multi-tenant application architecture when the energy requirements change. The implemented process is efficient for a high number of tenants in a reasonable time.",
        "month": "jul",
        "jcr": "Q4 (152/161) Computer Science, Information Systems. Impact factor: 0.729",
        "doi": "10.1109/TLA.2020.9099765",
        "pages": "1238-1246",
        "number": "07",
        "volume": "18",
        "year": "2020",
        "title": "Automatic Evolution of Eco-Efficient Software Architectures with CVL Models",
        "journal": "IEEE Latin America Trans.",
        "author": "José Miguel Horcas and Mónica Pinto",
        "ENTRYTYPE": "article",
        "ID": "Horcas2020_EvolutionCVLModels"
    },
    {
        "keywords": "Automated analysis, Constraint, Feature model, Feature tree, Parallelization, Software product line",
        "abstract": "Cross-tree constraints help to compact feature models by using arbitrary propositional logic formulas, which efficiently capture interdependencies between features. However, the existence of these constraints increases the complexity of reasoning about feature models, whether we use SAT solvers or compile the model to a binary decision diagram for efficient analyses. Although some works have tried to refactor constraints to eliminate them, they deal only with simple constraints (i.e., requires and excludes) or require introducing an additional set of features, increasing the size and complexity of the resulting feature model. This paper presents an approach that eliminates all the cross-tree constraints in regular boolean feature models, including arbitrary constraints in propositional logic formulas. Our approach for removing constraints consists of splitting the semantics of feature models into orthogonal disjoint feature subtrees, which are then analyzed in parallel to alleviate the exponential blow-up in memory of the resulting feature tree. We propose a codification of the constraints and define and analyze different heuristics for constraints ordering to reduce the complexity of identifying the valid disjoint subtrees when removing constraints.",
        "jcr": "Q1 (23/128) Computer Science, Software Engineering. Impact factor: 4.1",
        "bibsource": "dblp computer science bibliography, https://dblp.org",
        "biburl": "https://dblp.org/rec/journals/jss/HorcasBPF25.bib",
        "timestamp": "Sat, 31 May 2025 23:16:43 +0200",
        "doi": "10.1016/j.jss.2025.112434",
        "url": "https://doi.org/10.1016/j.jss.2025.112434",
        "month": "sep",
        "year": "2025",
        "pages": "112434",
        "specialissue": "SPLC 2023 Special Issue on Intelligent Software Product Lines",
        "volume": "227",
        "journal": "J. Syst. Softw.",
        "title": "FMSans: An efficient approach for constraints removal and parallel analysis of feature models",
        "author": "José Miguel Horcas and Joaquín Ballesteros and Mónica Pinto and Lidia Fuentes",
        "ENTRYTYPE": "article",
        "ID": "Horcas2025_FMSans"
    },
    {
        "note": "external collaboration",
        "keywords": "Random sampling, Configurable systems, Variability modeling, Software product lines, Kconfig, SAT, Randconfig",
        "abstract": "The configuration space of some systems is so large that it cannot be computed. This is the case with the Linux Kernel, which provides more than 18,000 configurable options described across almost 1,700 files in the Kconfig language. As a result, many analyses of these systems rely on sampling their configuration space (e.g., debugging compilation errors, predicting configuration performance, finding the configuration that optimizes specific performance metrics, among others.). The Kernel and other Kconfig-based systems can be sampled pragmatically, using their built-in tool conf to get a sample directly from the Kconfig specification that is approximately random, or idealistically, generating a genuine random sample by first translating the Kconfig files into logic formulas, then using a logic engine to compute the probability that each option value has to appear in a configuration, and finally utilizing these probabilities to generate an authentically random sample. The pros of the idealistic approach are that it ensures the sample is representative of the population, but the cons are that it sets out many challenging problems that have not been solved yet (fundamentally, how to obtain a valid translation into Boolean that covers all the Kconfig language, and how to compute the option value probabilities for very large formulas). This paper introduces a new version of conf called randconfig , which incorporates a series of improvements that increase the randomness and correctness of pragmatic sampling and also help validate the Boolean translation required for the idealistic approach. randconfig has been tested on ten versions of the Linux Kernel and twenty additional Kconfig systems. Its compatibility significantly enhances the current landscape, where some systems use a customized conf variant that is maintained independently, while others do not support sampling at all. randconfig not only offers universal sampling for all Kconfig systems but also simplifies its evolutive maintenance as a single tool rather than an unorganized collection of conf variants.",
        "jcr": "Q1 (23/128) Computer Science, Software Engineering. Impact factor: 4.1",
        "doi": "10.1016/j.jss.2025.112577",
        "url": "https://doi.org/10.1016/j.jss.2025.112577",
        "month": "dec",
        "year": "2025",
        "pages": "112577",
        "volume": "230",
        "journal": "J. Syst. Softw.",
        "title": "Pragmatic random sampling of Kconfig-based systems: A unified approach",
        "author": "David Fernández-Amorós and Rubén Heradio and José Miguel Horcas and José A. Galindo and David Benavides and Lidia Fuentes",
        "ENTRYTYPE": "article",
        "ID": "FernandezAmoros2025_RandconfigPlus"
    },
    {
        "scope": "national",
        "keywords": "Cardinalidad, Evolución, Línea de Producto Arquitectónica, Variabilidad, CVL",
        "abstract": "La computación en la nube se está convirtiendo en un mecanismo predominante para desplegar fácilmente aplicaciones con requisitos especiales, tales como el almacenamiento masivo compartido, o el equilibrado de carga. Esta funcionalidad se proporciona normalmente como servicios por las plataformas en la nube. Un desarrollador puede mejorar tanto el despliegue de sus aplicaciones como la productividad siguiendo un enfoque multi-tenancy, donde diferentes variantes de la misma aplicación pueden adaptarse rápidamente a las necesidades de cada usuario (tenant). Sin embargo, gestionar la variabilidad inherente a las aplicaciones multi-tenant, con cientos de usuarios y miles de configuraciones arquitectónicas diferentes, puede llegar a ser una tarea intratable de abordar manualmente. En este artículo, se propone un enfoque de línea de producto software en el cual: (1) usamos modelos de variabilidad con cardinalidad para modelar cada tenant como una característica clonable, (2) automatizamos el proceso de evolución de las arquitecturas de aplicaciones multi-tenant, y (3) demostramos que la implementación de los procesos de evolución es correcta y eficiente para un número elevado de tenants en un tiempo razonable.",
        "address": "Salamanca, Spain",
        "month": "sep",
        "year": "2016",
        "booktitle": "XXI Jornadas de Ingeniería del Software y Bases de Datos ({JISBD})",
        "url": "https://hdl.handle.net/11705/JISBD/2016/003",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "title": "Evolución arquitectónica de servicios basada en modelos CVL con cardinalidad",
        "publisher": "SISTEDES",
        "editor": "SISTEDES",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2016_JISBD_EvolucionCVL"
    },
    {
        "scope": "national",
        "keywords": "Atributos De Calidad, Eco-Eficiente, Energía, FQA, Línea De Productos Software, Variabilidad",
        "abstract": "Los atributos de calidad funcionales (FQAs) son aquellos que para satisfacerlos se necesita incorporar funcionalidad adicional a la arquitectura de las aplicación (e.g., seguridad). La nueva funcionalidad incorporada por estos FQAs (e.g., encriptación) afecta a otro atributo de calidad como es el consumo de energía de la aplicación. Hasta el momento no se han explorado suficientemente las interdependencias entre, por ejemplo diferentes niveles de seguridad y su incidencia en el consumo de energía. En este artículo se propone una solución para ayudar al arquitecto software a generar la configuración de los FQAs que optimiza la eficiencia energética de la aplicación. Para ello se define un modelo de uso para cada FQA, teniendo en cuenta las variables que influyen en el consumo de energía y como el valor de estas variables cambia en función del punto de la aplicación donde se requiere ese FQA. Se extiende una Línea de Productos Software que modela una familia de FQAs para incorporar la variabilidad del modelo de uso y los frameworks existentes que implementan los FQAs. Generamos la configuración más eco-eficiente seleccionando el framework y las características más adecuadas para cada FQA y configurándolo según los requisitos de la aplicación.",
        "address": "La Laguna, Tenerife, Spain",
        "month": "jul",
        "year": "2017",
        "booktitle": "XXII Jornadas de Ingeniería del Software y Bases de Datos ({JISBD})",
        "url": "https://hdl.handle.net/11705/JISBD/2017/003",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "title": "Configuración eco-eficiente de atributos de calidad funcionales",
        "publisher": "SISTEDES",
        "editor": "SISTEDES",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2017_JISBD_ConfigurationEcoeficienteFQA"
    },
    {
        "track": "tool",
        "scope": "national",
        "keywords": "CVL, Línea De Producto Software, Variabilidad, VEXgine",
        "abstract": "El Lenguaje CVL (Common Variability Language) carece de una herramienta flexible que permita poner en práctica las necesidades industriales del modelado de la variabilidad en Líneas de Producto Software. Las herramientas existentes que proporcionan soporte para CVL son prototipos incompletos, o se centran principalmente en la especificación de la variabilidad, sin llegar a resolverla sobre modelos reales. Además, no existe una API que permita la interacción directa con el motor CVL para extenderlo o usarlo en una aplicación independiente. Este artículo presenta vEXgine, una implementación adaptable y extensible del motor de ejecución de la variabilidad de CVL.",
        "address": "Seville, Spain",
        "month": "sep",
        "year": "2018",
        "booktitle": "XXIII Jornadas de Ingeniería del Software y Bases de Datos ({JISBD})",
        "url": "https://hdl.handle.net/11705/JISBD/2018/037",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "title": "vEXgine: Extendiendo el motor de ejecución de CVL",
        "publisher": "SISTEDES",
        "editor": "SISTEDES",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2018_JISBD_vEXgine"
    },
    {
        "scope": "national",
        "keywords": "Adaptabilidad, Android, Dispositivos Móviles, Eco-Eficiente, Energía, Reconfiguración Dinámica",
        "abstract": "Los dispositivos móviles ofrecen cada vez mayores prestaciones a costa de un mayor consumo energético. La energía consumida por un móvil no sólo depende de las aplicaciones en sí, sino también de las interacciones del usuario con la aplicación. Si un recurso no está siendo utilizado por la aplicación, no debería estar consumiendo energía. En este artículo se presenta un modelo de adaptación de aplicaciones móviles al contexto del usuario con el objetivo de reducir el consumo energético de las aplicaciones. Se desarrollan y evalúan cuatro implementaciones diferentes de la propuesta en busca del mecanismo de reconfiguración más eficiente energéticamente.",
        "address": "Seville, Spain",
        "month": "sep",
        "year": "2018",
        "booktitle": "XXIII Jornadas de Ingeniería del Software y Bases de Datos ({JISBD})",
        "url": "https://hdl.handle.net/11705/JISBD/2018/068",
        "author": "Ángel Cañete and José Miguel Horcas and Lidia Fuentes",
        "title": "Mecanismos de reconfiguración eco-eficiente de código en aplicaciones móviles Android",
        "publisher": "SISTEDES",
        "editor": "SISTEDES",
        "ENTRYTYPE": "inproceedings",
        "ID": "Canete2018_JISBD_ReconfiguracionEcoeficienteAndroid"
    },
    {
        "scope": "national",
        "keywords": "Líneas De Productos Software, Modelado, Soporte De Herramientas, Variabilidad",
        "abstract": "A pesar de la gran cantidad de trabajos y de herramientas existentes en el ámbito de las Líneas de Productos Software, muchos dominios de aplicación actuales no pueden verse beneficiados del uso de una Línea de Producto Software. Además, fuera del mundo académico, la empresa sigue siendo bastante reticente a usar este enfoque. En este artículo reflexionamos sobre las razones de esta falta de adopción, tanto desde el punto de vista de las características complejas que son imprescindibles en los sistemas actuales, como del soporte que las herramientas existentes proporcionan.",
        "address": "Cáceres, Spain",
        "month": "sep",
        "year": "2019",
        "booktitle": "XXIV Jornadas de Ingeniería del Software y Bases de Datos ({JISBD})",
        "url": "https://hdl.handle.net/11705/JISBD/2019/069",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "title": "Modelando la variabilidad de características complejas en líneas de productos software",
        "publisher": "SISTEDES",
        "editor": "SISTEDES",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2019_JISBD_ModelandoVariabilidadSPL"
    },
    {
        "track": "tool",
        "scope": "national",
        "keywords": "Analisis Automático, Líneas De Producto Software, MonteCarlo",
        "abstract": "La mayoría de los sistemas configurables describen un amplio espacio de soluciones que hacen intratable su exploración exhaustiva. En la literatura encontramos técnicas de análisis como la resolución SAT o la programación de restricciones. Sin embargo, ninguna de ellas ha explorado los métodos basados en la simulación de la toma de decisiones cuando configuramos un sistema. Nosotros proponemos usar el método de Montecarlo el cual simula la búsqueda en espacios de soluciones colosales de manera aleatoria. Este trabajo presenta la implementación de un marco conceptual que aborda varios de esos análisis utilizando métodos de Montecarlo, los cuales, han demostrado tener éxito en otros dominios con espacios de búsqueda colosales como la teoría de juegos. Concretamente presentamos una implementación en Python del marco de trabajo que muestra la viabilidad de nuestra propuesta con la que prevemos que se pueden abordar diferentes problemas y que nuestro marco pueda utilizarse para avanzar el estado del arte.",
        "address": "Málaga, Spain",
        "month": "sep",
        "year": "2021",
        "booktitle": "XXV Jornadas de Ingeniería del Software y Bases de Datos ({JISBD})",
        "url": "https://hdl.handle.net/11705/JISBD/2021/028",
        "author": "José Miguel Horcas and Antonio Germán Márquez and José A. Galindo and David Benavides",
        "title": "Una herramienta para aplicar técnicas de Montecarlo al análisis de modelos de características",
        "publisher": "SISTEDES",
        "editor": "SISTEDES",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2021_JISBD_HerramientaMontecarlo"
    },
    {
        "track": "tool",
        "scope": "national",
        "keywords": "Línea De Productos Software, Variabilidad, Visualización",
        "abstract": "La visualización de datos expone una gran cantidad de variabilidad a nivel de diseño de gráficos y su implementación con las herramientas existentes. Sin embargo, no todas las configuraciones son igual de efectivas para representar datos. Nosotros proponemos una línea de productos software (SPL) para la visualización de datos que sintetiza la variabilidad y los principios y buenas prácticas de diseño en visualización de datos, modelando aquellas opciones recomendadas por los expertos en visualización y reduciendo la variabilidad expuesta por las librerías software existentes. Este trabajo presenta la implementación de la SPL de visualización de datos. Concretamente se presentan los artefactos desarrollados en la SPL, incluyendo el modelo de variabilidad y la implementación de las visualizaciones usando plantillas variables, y se muestra la viabilidad de nuestra propuesta con la que se abre una nueva línea de investigación donde se aplican técnicas de variabilidad a la visualización de datos.",
        "address": "Santiago de Compostela, Spain",
        "month": "sep",
        "year": "2022",
        "booktitle": "XXVI Jornadas de Ingeniería del Software y Bases de Datos ({JISBD})",
        "url": "https://hdl.handle.net/11705/JISBD/2022/8222",
        "author": "José Miguel Horcas and José A. Galindo and David Benavides",
        "title": "Una línea de productos software para la visualización de datos",
        "publisher": "SISTEDES",
        "editor": "SISTEDES",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2022_JISBD_SPLVisualizacionDatos"
    },
    {
        "track": "PhD Consortium",
        "scope": "national",
        "keywords": "Líneas de productos de migraciones, Migraciones de datos, Transformación de modelos, Variabilidad entre bases de datos",
        "abstract": "Las bases de datos relacionales se usan ampliamente en el desarrollo de aplicaciones informáticas. Su implementación más común se encuentra en los Sistemas de Gestión de Contenidos (CMS, por sus siglas en inglés), que están presentes en la mayoría de los sitios web. Sin embargo, la migración de la estructura y el contenido de una base de datos entre diferentes sistemas de gestión no es un proceso sencillo. La creación manual de scripts dificulta su reutilización en otros escenarios. Este documento propone una solución para la migración de bases de datos mediante el modelado de una línea de productos de migraciones. Con este método, es posible obtener diferentes configuraciones y productos finales válidos de forma semiautomática, considerando la variabilidad entre dos bases de datos relacionales cualesquiera. Para demostrar la viabilidad de la propuesta, se ha implementado una prueba de concepto que realiza la migración entre dos bases de datos.",
        "address": "Cádiz, Spain",
        "month": "jun",
        "year": "2022",
        "booktitle": "II Jornadas de Investigación Predoctoral en Ingeniería Informática ({JIPII})",
        "url": "http://hdl.handle.net/10498/27607",
        "author": "David Romero-Organvidez and David Benavides and José Miguel Horcas",
        "title": "Aplicar técnicas de variabilidad para la migración de datos, un enfoque transformacional",
        "ENTRYTYPE": "inproceedings",
        "ID": "RomeroOrganvidez2022_JIPII_VariabilidadMigracionDatos"
    },
    {
        "note": "external collaboration",
        "track": "tool",
        "scope": "national",
        "keywords": "Data Migration, Data Transformation, Software Product Line, Feature Model",
        "abstract": "Software modernization often involves complex data migration projects, which can result in resource loss and delays. Data migration typically requires ETL (Extraction, Transformation, and Load) operations, but there is limited literature on reusing data migration artifacts to reduce complexity. This paper introduces a tool that employs software product line techniques in data migration projects, specifically in the data transformation stage, to systematize artifact reuse. The proposed solution enables the automatic creation of scripts through configuration techniques, streamlining the data transformation process. This tool's feasibility is demonstrated in web information systems modernization, where data is migrated between Drupal and WordPress portals. Various migration scripts are generated by selecting different features, showcasing the method's versatility. This innovative tool is the first to utilize a complete stack of software product line techniques, enabling the reuse of artifacts for data migration. This tool opens up new opportunities for further applications of software product line techniques in data migration projects across various domains.",
        "address": "Ciudad Real, Spain",
        "month": "sep",
        "year": "2023",
        "booktitle": "XXVII Jornadas de Ingeniería del Software y Bases de Datos ({JISBD})",
        "url": "https://hdl.handle.net/11705/JISBD/2023/3390",
        "author": "David Romero-Organvidez and José Miguel Horcas and María Teresa Gómez-López and David Benavides",
        "title": "Transformo: a tool for data transformation using SPL techniques",
        "publisher": "SISTEDES",
        "editor": "SISTEDES",
        "ENTRYTYPE": "inproceedings",
        "ID": "RomeroOrganvidez2023_JISBD_Transformo"
    },
    {
        "scope": "national",
        "keywords": "Análisis Automático, Árbol De Característica, GFT, Modelo De Variabilidad, SPL, Solver",
        "abstract": "Un árbol de características generalizado (GFT) es un modelo de variabilidad en el que las restricciones textuales han sido eliminadas manteniendo la semántica del modelo. La ventaja de un GFT es que se puede analizar directamente razonando sobre las relaciones jerárquicas del árbol de características sin tener que transformar el modelo a SAT o construir un árbol de decisión binario (BDD). La desventaja de un GFT es que puede contener características duplicadas y su tamaño en número de características con respecto al modelo de variabilidad original es considerablemente mayor, lo que complica el análisis automático. En este artículo se propone un analizador de modelos GFT basado en las relaciones jerárquicas del árbol de características teniendo en cuenta la existencia de características duplicadas. Se definen un conjunto de operaciones de análisis sobre GFT y se compara su eficiencia con solvers SAT y BDD. El solver GFT mejora la eficiencia del análisis sobre solvers BDD para modelos de hasta diez mil características.",
        "address": "Ciudad Real, Spain",
        "month": "sep",
        "year": "2023",
        "booktitle": "XXVII Jornadas de Ingeniería del Software y Bases de Datos ({JISBD})",
        "url": "https://hdl.handle.net/11705/JISBD/2023/268",
        "author": "José Miguel Horcas and Mónica Pinto and Lidia Fuentes",
        "title": "Un analizador de modelos de variabilidad basado en el árbol de características",
        "publisher": "SISTEDES",
        "editor": "SISTEDES",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2023_JISBD_AnalizadorGFT"
    },
    {
        "scope": "national",
        "keywords": "Árbol De Características, Heurísticas, Modelo De Variabilidad, Restricciones, SPL",
        "abstract": "El análisis automático de los modelos de variabilidad se realiza habitualmente transformando el modelo a SAT o construyendo un árbol de decisión binario. Una alternativa que se está explorando en los últimos años es la eliminación de las restricciones del modelo, manteniendo su semántica. La principal ventaja de este enfoque es la posibilidad de analizar el modelo directamente sobre el árbol de características, razonando sobre las relaciones jerárquicas del árbol. La principal desventaja es que el tamaño del árbol crece sustancialmente para modelos grandes y complejos, dando lugar a problemas de escalabilidad tanto a nivel de tiempo de análisis como de espacio de almacenamiento. En un trabajo previo definimos la propuesta FMSans para la eliminación de todas las restricciones de un modelo de variabilidad, basada en el uso de árboles disjuntos y en el uso de paralelismo tanto para la generación de los árboles como para su análisis. En este artículo se proponen cuatro heurísticas para reordenar las restricciones del modelo y reducir el tiempo necesario para identificar los árboles disjuntos resultantes de eliminar las restricciones del modelo de variabilidad.",
        "address": "A Coruña, Spain",
        "month": "jun",
        "year": "2024",
        "booktitle": "XXVIII Jornadas de Ingeniería del Software y Bases de Datos ({JISBD})",
        "url": "https://hdl.handle.net/11705/JISBD/2024/75",
        "author": "José Miguel Horcas and Joaquín Ballesteros and Mónica Pinto and Lidia Fuentes",
        "title": "Heurísticas para mejorar el rendimiento en la eliminación de restricciones en modelos de características",
        "publisher": "SISTEDES",
        "editor": "SISTEDES",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2024_JISBD_HeuristicasEliminacionRestricciones"
    },
    {
        "scope": "national",
        "keywords": "Arbol De Características, Diagrama De Decisión Binario, Modelo De Variabilidad, Divide Y Vencerás, SPL",
        "abstract": "Los modelos de variabilidad, especialmente los modelos de características, son fundamentales para describir las características visibles para el usuario en líneas de productos de software (SPLs). Sin embargo, el análisis de SPLs se enfrenta a desafíos significativos cuando se trata de modelos de variabilidad muy grandes. Aunque técnicas como los resolutores de satisfacibilidad (SAT) y los diagramas de decisión binarios (BDD) son útiles, algunos análisis complejos siguen siendo difíciles de abordar de manera eficiente. En este artículo, proponemos una estrategia innovadora de dividir los modelos de variabilidad en subconjuntos no disjuntos, junto con un algoritmo para generar configuraciones válidas en estos subconjuntos. Demostramos que esta técnica no solo mejora significativamente los tiempos y el espacio necesarios para el análisis de SPLs, sino que también hace posible operaciones de análisis en modelos de variabilidad que de otro modo serían intratables.",
        "address": "A Coruña, Spain",
        "month": "jun",
        "year": "2024",
        "booktitle": "XXVIII Jornadas de Ingeniería del Software y Bases de Datos ({JISBD})",
        "url": "https://hdl.handle.net/11705/JISBD/2024/112",
        "author": "Joaquín Ballesteros and José Miguel Horcas and Lidia Fuentes",
        "title": "DiBDDme, una estrategia de división no disjunta para el análisis de Modelos de Variabilidad",
        "publisher": "SISTEDES",
        "editor": "SISTEDES",
        "ENTRYTYPE": "inproceedings",
        "ID": "Ballesteros2024_JISBD_DiBDDme"
    },
    {
        "track": "tool",
        "note": "external collaboration",
        "scope": "national",
        "keywords": "Feature Model, Software Product, Variability, Datasets, UVL",
        "abstract": "Los feature models son el estándar de facto para representar la variabilidad en las líneas de productos de software. Existen varios lenguajes propuestos para describir modelos de características, como el UVL (Universal Variability Language). UVL es un esfuerzo de la comunidad para crear un estándar para describir modelos de características. Estos modelos de características suelen estar disponibles en conjuntos de datos en repositorios con deuda técnica, son obsoletos o privados, lo que dificulta su reutilización y estudio en investigaciones posteriores. Este artículo describe la herramienta UVLHub, un repositorio de dataset de modelos de características en formato UVL. La herramienta utiliza Zenodo como backend, un repositorio que sigue los principios de la Ciencia Abierta y promueve la transparencia, la accesibilidad y el almacenamiento permanente. UVLHub proporciona utilidades que ayudan en el procesamiento, la gestión y la búsqueda de modelos.",
        "address": "A Coruña, Spain",
        "month": "jun",
        "year": "2024",
        "booktitle": "XXVIII Jornadas de Ingeniería del Software y Bases de Datos ({JISBD})",
        "url": "https://hdl.handle.net/11705/JISBD/2024/17",
        "author": "David Romero-Organvidez and José A. Galindo and Chico Sundermann and José Miguel Horcas and David Benavides",
        "title": "UVLHub: compartir modelos en UVL siguiendo principios de ciencia abierta",
        "publisher": "SISTEDES",
        "editor": "SISTEDES",
        "ENTRYTYPE": "inproceedings",
        "ID": "RomeroOrganvidez2024_JISBD_UVLHubCienciaAbierta"
    },
    {
        "track": "tool",
        "note": "external collaboration",
        "scope": "national",
        "keywords": "Framework, Automated Analysis, Variability Models, Python",
        "abstract": "En este artículo, presentamos la herramienta Flama para el análisis de diversos tipos de modelos de variabilidad. Este framework trata como elemento de primer orden la colaboración entre desarrolladores e investigadores. Asimismo, presentamos un distribución de Flama específicamente optimizada para el análisis de modelos de características.",
        "address": "A Coruña, Spain",
        "month": "jun",
        "year": "2024",
        "booktitle": "XXVIII Jornadas de Ingeniería del Software y Bases de Datos ({JISBD})",
        "url": "https://hdl.handle.net/11705/JISBD/2024/26",
        "author": "José A. Galindo and José Miguel Horcas and Viet-Man Le and Alexander Felfernig and Rubén Heradio and David Fernández-Amorós and David Benavides",
        "title": "Flama: un esfuerzo colaborativo para soportar de forma sostenible el análisis de modelos de variabilidad",
        "publisher": "SISTEDES",
        "editor": "SISTEDES",
        "ENTRYTYPE": "inproceedings",
        "ID": "Galindo2024_JISBD_Flama"
    },
    {
        "scope": "national",
        "keywords": "Configuración, Kubernetes, Feature Model, Modelo De Características, Modelo De Variabilidad",
        "abstract": "Kubernetes es una plataforma altamente configurable para el despliegue y orquestación de aplicaciones contenerizadas, pero su flexibilidad conlleva desafíos en la gestión de sus múltiples opciones de configuración. Las técnicas actuales de ingeniería inversa de modelos de variabilidad no son directamente aplicables a Kubernetes debido al uso extensivo de valores por defecto en los ficheros de configuración y a la complejidad de sus opciones, que van más allá de simples parámetros booleanos. Modelar esta variabilidad requiere conceptos avanzados como características numéricas y tipadas, características clonables, atributos y restricciones aritméticas. En este trabajo, presentamos dos modelos de variabilidad de Kubernetes obtenidos mediante enfoques complementarios: (1) un modelo sintetizado manualmente a partir de la documentación oficial, y (2) un modelo generado automáticamente a partir de los esquemas JSON de la API. Ambos modelos, especificados en UVL, incorporan los conceptos avanzados de variabilidad necesarios para capturar la configurabilidad de Kubernetes de manera estructurada y explicable. Caracterizamos y comparamos ambos modelos en términos de tamaño y complejidad. Con este trabajo, proporcionamos a la comunidad de líneas de productos software un nuevo caso de estudio de un sistema de alta variabilidad del mundo real, facilitando la comprensión y gestión de su espacio de configuración.",
        "address": "Córdoba, Spain",
        "month": "sep",
        "year": "2025",
        "booktitle": "XXIX Jornadas de Ingeniería del Software y Bases de Datos ({JISBD})",
        "url": "https://hdl.handle.net/11705/JISBD/2025/40",
        "author": "José Miguel Horcas and Mercedes Amor Pinilla and Lidia Fuentes",
        "title": "Sintetización de la variabilidad en Kubernetes: Dos modelos de características complementarios",
        "publisher": "SISTEDES",
        "editor": "SISTEDES",
        "ENTRYTYPE": "inproceedings",
        "ID": "Horcas2025_JISBD_ModelosKubernetes"
    },
    {
        "note": "external collaboration",
        "track": "short",
        "scope": "national",
        "keywords": "Backbone, Core & Dead Features, Modelo De Variabilidad, SAT Solver",
        "abstract": "El backbone de un modelo de variabilidad es su conjunto de características obligatorias y muertas. El conocimiento de dicho conjunto facilita importantes operaciones de análisis, tales como (i) la detección de código muerto que nunca llegará a ejecutarse en una configuración válida, (ii) la propagación de decisiones de configuración (p.ej., ¿qué características deben activarse/desactivarse como resultado de la selección de esta otra característica?), y (iii) la simplificación de modelos de variabilidad para facilitar procesamientos posteriores que requieran un alto coste computacional (p.ej., el muestreo aleatorio uniforme de configuraciones, la búsqueda de configuraciones que optimicen parámetros de calidad, etc.). En el área de las líneas de productos software, se vienen empleando dos algoritmos básicos para el cálculo de backbones que no escalan para modelos de variabilidad grandes (p.ej., el Kernel de Linux). Sin embargo, en el ámbito de los SAT solvers se han propuesto otros algoritmos más complejos, que parecen escalar mejor en benchmarks que mayoritariamente se basan en fórmulas lógicas sintéticas y modelos de circuitos. En nuestro trabajo, nos proponemos evaluar, sobre un extenso y variado benchmark de modelos de variabilidad, la escalabilidad de dichos algoritmos avanzados para comprobar si efectivamente éstos deberían sustituir a los algoritmos básicos que se vienen utilizando en las herramientas de líneas de productos software.",
        "address": "Córdoba, Spain",
        "month": "sep",
        "year": "2025",
        "booktitle": "XXIX Jornadas de Ingeniería del Software y Bases de Datos ({JISBD})",
        "url": "https://hdl.handle.net/11705/JISBD/2025/5",
        "author": "Luis Cambelo and Rubén Heradio and José Miguel Horcas and David Fernández-Amorós",
        "title": "Herramientas para el Cómputo del Backbone de un Modelo de Variabilidad",
        "publisher": "SISTEDES",
        "editor": "SISTEDES",
        "ENTRYTYPE": "inproceedings",
        "ID": "Cambelo2025_JISBD_Backbone"
    },
    {
        "note": "external collaboration",
        "track": "tool",
        "scope": "national",
        "keywords": "UVL Ecosystem, UVLHub, Flamapy, Flamapy IDE, UVL.js, UVL Sentinel, FM Fact Label",
        "abstract": "La aparición de UVL (Universal Variability Language) ha impulsado el desarrollo de un ecosistema de herramientas diseñadas para el modelado, análisis, almacenamiento y visualización de modelos de variabilidad. En este trabajo, presentamos una visión integral del ecosistema UVL en el que hemos aportado de una forma u otra las organizaciones a las que pertenecen los investigadores que firman el trabajo, detallando las herramientas que lo conforman y su interoperabilidad. Analizamos y exploramos cómo estas herramientas permiten la integración con otras soluciones, fomentando la adopción de UVL como estándar en la descripción de modelos de variabilidad.",
        "address": "Córdoba, Spain",
        "month": "sep",
        "year": "2025",
        "booktitle": "XXIX Jornadas de Ingeniería del Software y Bases de Datos ({JISBD})",
        "url": "https://hdl.handle.net/11705/JISBD/2025/39",
        "author": "David Romero-Organvídez and José Miguel Horcas and Víctor Lamas and Miguel R. Luaces and Francisco Sebastián Benítez and Noelia López-Durán and David Benavides",
        "title": "Ecosistema UVL: integración de herramientas para sistemas de alta variabilidad",
        "publisher": "SISTEDES",
        "editor": "SISTEDES",
        "ENTRYTYPE": "inproceedings",
        "ID": "RomeroOrganvidez2025_JISBD_EcosistemaUVL"
    },
    {
        "month": "oct",
        "year": "2025",
        "address": "Marbella, Spain",
        "booktitle": "31th International Conference on Cooperative Information Systems (CoopIS)",
        "title": "Automated Synthesis of Kubernetes Variability from OpenAPI Schemas",
        "author": "Brian Flores and José Miguel Horcas and Mercedes Amor and Lidia Fuentes",
        "ENTRYTYPE": "inproceedings",
        "ID": "Flores2025_KubernetesFM"
    }
]